embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
typedef struct                                  /*!< PKA Structure                                                             */
{
  __IO uint32_t  CR;                           /*!< (@ 0x00000000) Control register                                           */
  __IO uint32_t  SR;                           /*!< (@ 0x00000004) Status register                                            */
  __IO uint32_t  CLRFR;                        /*!< (@ 0x00000008) Clear flag register                                        */
  uint32_t Reserved[253];                     /*!< Reserved memory area              Address offset: 0x0C  -> 0x03FC         */
  __IO uint32_t RAM[1334];                      /*!< PKA RAM                           Address offset: 0x400 -> 0x18D4         */
} PKA_TypeDef;                                  /*!< Size = 12 (0x0C)                                                          */

typedef struct                                  /*!< PKA Structure                                                             */
{
  __IO uint32_t  RAM[894];                     /*!< PKA RAM, Address offset: 0x0400-0x11F4                                    */
} PKA_RAM_TypeDef;                              /*!< Size = 3576 (0xDF8)                                                          */


/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ADC (ADC)
  */

typedef struct                                  /*!< ADC Structure                                                             */
{
  __IO uint32_t  VERSION_ID;                   /*!< (@ 0x00000000) VERSION_ID register                                        */
  __IO uint32_t  CONF;                         /*!< (@ 0x00000004) ADC configuration register                                 */
  __IO uint32_t  CTRL;                         /*!< (@ 0x00000008) ADC control register                                       */
  __IO uint32_t  RESERVED[2];
  __IO uint32_t  SWITCH;                       /*!< (@ 0x00000014) ADC switch control for Input Selection                     */
  __IO uint32_t  RESERVED1;
  __IO uint32_t  DS_CONF;                      /*!< (@ 0x0000001C) Downsampler configuration register                         */
  __IO uint32_t  SEQ_1;                        /*!< (@ 0x00000020) ADC regular sequence configuration register 1              */
  __IO uint32_t  SEQ_2;                        /*!< (@ 0x00000024) ADC regular sequence configuration register 2              */
  __IO uint32_t  COMP_1;                       /*!< (@ 0x00000028) ADC Gain & offset correction values register 1             */
  __IO uint32_t  COMP_2;                       /*!< (@ 0x0000002C) ADC Gain & offset correction values register 2             */
  __IO uint32_t  COMP_3;                       /*!< (@ 0x00000030) ADC Gain & offset correction values register 3             */
  __IO uint32_t  COMP_4;                       /*!< (@ 0x00000034) ADC Gain & offset correction values register 4             */
  __IO uint32_t  COMP_SEL;                     /*!< (@ 0x00000038) ADC Gain & Offset selection values register                */
  __IO uint32_t  WD_TH;                        /*!< (@ 0x0000003C) High/low limits for event monitoring a channel register    */
  __IO uint32_t  WD_CONF;                      /*!< (@ 0x00000040) Channel selection for event monitoring register            */
  __IO uint32_t  DS_DATAOUT;                   /*!< (@ 0x00000044) Downsampler Data output register                           */
  __IO uint32_t  RESERVED2;
  __IO uint32_t  IRQ_STATUS;                   /*!< (@ 0x0000004C) Interrupt Status register                                  */
  __IO uint32_t  IRQ_ENABLE;                   /*!< (@ 0x00000050) Enable/disable Interrupts                                  */
  __IO uint32_t  TIMER_CONF;                   /*!< (@ 0x00000054) Time to add after an LDO Enable or ADC Enable
                                                                    to let the HW to be stable before using it                 */
} ADC_TypeDef;                                  /*!< Size = 88 (0x58)                                                          */


/* =========================================================================================================================== */
/* ================                                     BLUE                                                  ================ */
/* =========================================================================================================================== */


/**
  * @brief BLUE Radio (BLUE)
  */

typedef struct                                  /*!< BLUE structure                                                            */
{
  __IO uint32_t  RESERVED;
  __IO uint32_t  INTERRUPT1REG;                /*!< (@ 0x00000004) Interrupt1 register                                        */
  __IO uint32_t  INTERRUPT2REG;                /*!< (@ 0x00000008) Interrupt2 register                                        */
  __IO uint32_t  TIMEOUTDESTREG;               /*!< (@ 0x0000000C) TimeoutDest register                                       */
  __IO uint32_t  TIMEOUTREG;                   /*!< (@ 0x00000010) Timeout register                                           */
  __IO uint32_t  TIMERCAPTUREREG;              /*!< (@ 0x00000014) TimerCapture register                                      */
  __IO uint32_t  CMDREG;                       /*!< (@ 0x00000018) Cmd register                                               */
  __IO uint32_t  STATUSREG;                    /*!< (@ 0x0000001C) Status register                                            */
  __IO uint32_t  INTERRUPT1ENABLEREG;          /*!< (@ 0x00000020) Interrupt1Enable register                                  */
  __IO uint32_t  INTERRUPT1LATENCYREG;         /*!< (@ 0x00000024) Interrupt1Latency register                                 */
  __IO uint32_t  MANAESKEY0REG;                /*!< (@ 0x00000028) ManAesKey0 register                                        */
  __IO uint32_t  MANAESKEY1REG;                /*!< (@ 0x0000002C) ManAesKey1 register                                        */
  __IO uint32_t  MANAESKEY2REG;                /*!< (@ 0x00000030) ManAesKey2 register                                        */
  __IO uint32_t  MANAESKEY3REG;                /*!< (@ 0x00000034) ManAesKey3 register                                        */
  __IO uint32_t  MANAESCLEARTEXT0REG;          /*!< (@ 0x00000038) ManAesClearText0 register                                  */
  __IO uint32_t  MANAESCLEARTEXT1REG;          /*!< (@ 0x0000003C) ManAesClearText1 register                                  */
  __IO uint32_t  MANAESCLEARTEXT2REG;          /*!< (@ 0x00000040) ManAesClearText2 register                                  */
  __IO uint32_t  MANAESCLEARTEXT3REG;          /*!< (@ 0x00000044) ManAesClearText3 register                                  */
  __IO uint32_t  MANAESCIPHERTEXT0REG;         /*!< (@ 0x00000048) ManAESCipherText0 register                                 */
  __IO uint32_t  MANAESCIPHERTEXT1REG;         /*!< (@ 0x0000004C) ManAESCipherText1 register                                 */
  __IO uint32_t  MANAESCIPHERTEXT2REG;         /*!< (@ 0x00000050) ManAESCipherText2 register                                 */
  __IO uint32_t  MANAESCIPHERTEXT3REG;         /*!< (@ 0x00000054) ManAESCipherText3 register                                 */
  __IO uint32_t  MANAESCMDREG;                 /*!< (@ 0x00000058) ManAESCmd register                                         */
  __IO uint32_t  MANAESSTATREG;                /*!< (@ 0x0000005C) ManAESStat register                                        */
  __IO uint32_t  AESLEPRIVPOINTERREG;          /*!< (@ 0x00000060) AesLePrivPointer register                                  */
  __IO uint32_t  AESLEPRIVHASHREG;             /*!< (@ 0x00000064) AesLePrivHash register                                     */
  __IO uint32_t  AESLEPRIVPRANDREG;            /*!< (@ 0x00000068) AesLePrivPrand register                                    */
  __IO uint32_t  AESLEPRIVCMDREG;              /*!< (@ 0x0000006C) AesLePrivCmd register                                      */
  __IO uint32_t  AESLEPRIVSTATREG;             /*!< (@ 0x00000070) AesLePrivStat register                                     */
  __IO uint32_t  DEBUGCMDREG;                  /*!< (@ 0x00000074) DebugCmd register                                          */
  __IO uint32_t  DEBUGSTATUSREG;               /*!< (@ 0x00000078) DebugStatus register                                       */
  __IO uint32_t  STATUS2REG;                   /*!< (@ 0x0000007C) Status2 register                                           */
  __IO uint32_t  RESERVED1;
} BLUE_TypeDef;                                 /*!< Size = 132 (0x84)                                                         */


/* =========================================================================================================================== */
/* ================                                     RADIO_CTRL                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Radio Controller (RADIO_CTRL)
  */

typedef struct                                  /*!< Radio Control structure                                                   */
{
  __IO uint32_t RADIO_CONTROL_ID;            /*!< (@ 0x00000000) Radio Controller ID register                               */
  __IO uint32_t  CLK32COUNT_REG;              /*!< (@ 0x00000004) Window length register                                     */
  __IO uint32_t  CLK32PERIOD_REG;             /*!< (@ 0x00000008) Slow clock period register                                 */
  __IO uint32_t CLK32FREQUENCY_REG;          /*!< (@ 0x0000000C) Slow clock frequency register                              */
  __IO uint32_t  RADIO_CONTROL_IRQ_STATUS;    /*!< (@ 0x00000010) Radio Controller Interrupt Status register                 */
  __IO uint32_t  RADIO_CONTROL_IRQ_ENABLE;    /*!< (@ 0x00000014) Radio Controller Interrupt Control register                */
  __IO uint32_t RESERVED;
} RADIO_CTRL_TypeDef;                           /*!< Size = 28 (0x1C)                                                          */


/* =========================================================================================================================== */
/* ================                                     RRM                                                   ================ */
/* =========================================================================================================================== */


/**
  * @brief RRM (RRM)
 */

