embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* Peripherals available on AHB bus */
#define GPIOA                       ((GPIO_TypeDef*)                                  GPIOA_BASE)
#define GPIOB                       ((GPIO_TypeDef*)                                  GPIOB_BASE)
#define CRC                         ((CRC_TypeDef*)                                     CRC_BASE)
#define PKA                         ((PKA_TypeDef*)                                     PKA_BASE)
#define PKA_RAM                     ((PKA_RAM_TypeDef*)                             PKA_RAM_BASE)
#define RCC                         ((RCC_TypeDef*)                                     RCC_BASE)
#define PWR                         ((PWR_TypeDef*)                                     PWR_BASE)
#define RNG                         ((RNG_TypeDef*)                                     RNG_BASE)
#define DMA1                        ((DMA_TypeDef*)                                    DMA1_BASE)
#define DMA1_Channel1               ((DMA_Channel_TypeDef *)                  DMA1_Channel1_BASE)
#define DMA1_Channel2               ((DMA_Channel_TypeDef *)                  DMA1_Channel2_BASE)
#define DMA1_Channel3               ((DMA_Channel_TypeDef *)                  DMA1_Channel3_BASE)
#define DMA1_Channel4               ((DMA_Channel_TypeDef *)                  DMA1_Channel4_BASE)
#define DMA1_Channel5               ((DMA_Channel_TypeDef *)                  DMA1_Channel5_BASE)
#define DMA1_Channel6               ((DMA_Channel_TypeDef *)                  DMA1_Channel6_BASE)
#define DMA1_Channel7               ((DMA_Channel_TypeDef *)                  DMA1_Channel7_BASE)
#define DMA1_Channel8               ((DMA_Channel_TypeDef *)                  DMA1_Channel8_BASE)
#define DMAMUX1                     ((DMAMUX_Channel_TypeDef *)                     DMAMUX1_BASE)
#define DMAMUX1_Channel0            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel0_BASE)
#define DMAMUX1_Channel1            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel1_BASE)
#define DMAMUX1_Channel2            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel2_BASE)
#define DMAMUX1_Channel3            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel3_BASE)
#define DMAMUX1_Channel4            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel4_BASE)
#define DMAMUX1_Channel5            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel5_BASE)
#define DMAMUX1_Channel6            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel6_BASE)
#define DMAMUX1_Channel7            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel7_BASE)

/* Peripherals available on APB2 bus */
#define BLUE                        ((BLUE_TypeDef*)                BLUE_BASE)
#define RADIO                       (BLUE)
#define RADIO_CTRL                  ((RADIO_CTRL_TypeDef*)    RADIO_CTRL_BASE)
#define RRM                         ((RRM_TypeDef*)                  RRM_BASE)
#define WAKEUP                      ((WAKEUP_TypeDef*)            WAKEUP_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */

/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
#pragma pop
#elif defined (__ICCARM__)
/* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic pop
#elif defined (__GNUC__)
/* anonymous unions are enabled by default */
#elif defined (__TMS470__)
/* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning restore
#elif defined (__CSMC__)
/* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */

/* =========================================================================================================================== */
/*=====================                                       DMA                                       ===================== */
/* =========================================================================================================================== */

/* =====================================================    ISR    ===================================================== */
#define DMA_ISR_TEIF8_Pos                                                  (31UL)   /*!<DMA ISR: TEIF8 (Bit 31) */
#define DMA_ISR_TEIF8_Msk                                                  (0x80000000UL)   /*!< DMA ISR: TEIF8 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF8                                                      DMA_ISR_TEIF8_Msk
#define DMA_ISR_HTIF8_Pos                                                  (30UL)   /*!<DMA ISR: HTIF8 (Bit 30) */
#define DMA_ISR_HTIF8_Msk                                                  (0x40000000UL)   /*!< DMA ISR: HTIF8 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF8                                                      DMA_ISR_HTIF8_Msk
#define DMA_ISR_TCIF8_Pos                                                  (29UL)   /*!<DMA ISR: TCIF8 (Bit 29) */
#define DMA_ISR_TCIF8_Msk                                                  (0x20000000UL)   /*!< DMA ISR: TCIF8 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF8                                                      DMA_ISR_TCIF8_Msk
#define DMA_ISR_GIF8_Pos                                                   (28UL)   /*!<DMA ISR: GIF8 (Bit 28) */
#define DMA_ISR_GIF8_Msk                                                   (0x10000000UL)   /*!< DMA ISR: GIF8 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF8                                                       DMA_ISR_GIF8_Msk
#define DMA_ISR_TEIF7_Pos                                                  (27UL)   /*!<DMA ISR: TEIF7 (Bit 27) */
#define DMA_ISR_TEIF7_Msk                                                  (0x8000000UL)    /*!< DMA ISR: TEIF7 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF7                                                      DMA_ISR_TEIF7_Msk
#define DMA_ISR_HTIF7_Pos                                                  (26UL)   /*!<DMA ISR: HTIF7 (Bit 26) */
#define DMA_ISR_HTIF7_Msk                                                  (0x4000000UL)    /*!< DMA ISR: HTIF7 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF7                                                      DMA_ISR_HTIF7_Msk
#define DMA_ISR_TCIF7_Pos                                                  (25UL)   /*!<DMA ISR: TCIF7 (Bit 25) */
#define DMA_ISR_TCIF7_Msk                                                  (0x2000000UL)    /*!< DMA ISR: TCIF7 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF7                                                      DMA_ISR_TCIF7_Msk
#define DMA_ISR_GIF7_Pos                                                   (24UL)   /*!<DMA ISR: GIF7 (Bit 24) */
#define DMA_ISR_GIF7_Msk                                                   (0x1000000UL)    /*!< DMA ISR: GIF7 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF7                                                       DMA_ISR_GIF7_Msk
#define DMA_ISR_TEIF6_Pos                                                  (23UL)   /*!<DMA ISR: TEIF6 (Bit 23) */
#define DMA_ISR_TEIF6_Msk                                                  (0x800000UL)   /*!< DMA ISR: TEIF6 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF6                                                      DMA_ISR_TEIF6_Msk
#define DMA_ISR_HTIF6_Pos                                                  (22UL)   /*!<DMA ISR: HTIF6 (Bit 22) */
#define DMA_ISR_HTIF6_Msk                                                  (0x400000UL)   /*!< DMA ISR: HTIF6 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF6                                                      DMA_ISR_HTIF6_Msk
#define DMA_ISR_TCIF6_Pos                                                  (21UL)   /*!<DMA ISR: TCIF6 (Bit 21) */
#define DMA_ISR_TCIF6_Msk                                                  (0x200000UL)   /*!< DMA ISR: TCIF6 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF6                                                      DMA_ISR_TCIF6_Msk
#define DMA_ISR_GIF6_Pos                                                   (20UL)   /*!<DMA ISR: GIF6 (Bit 20) */
#define DMA_ISR_GIF6_Msk                                                   (0x100000UL)   /*!< DMA ISR: GIF6 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF6                                                       DMA_ISR_GIF6_Msk
#define DMA_ISR_TEIF5_Pos                                                  (19UL)   /*!<DMA ISR: TEIF5 (Bit 19) */
#define DMA_ISR_TEIF5_Msk                                                  (0x80000UL)    /*!< DMA ISR: TEIF5 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF5                                                      DMA_ISR_TEIF5_Msk
#define DMA_ISR_HTIF5_Pos                                                  (18UL)   /*!<DMA ISR: HTIF5 (Bit 18) */
#define DMA_ISR_HTIF5_Msk                                                  (0x40000UL)    /*!< DMA ISR: HTIF5 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF5                                                      DMA_ISR_HTIF5_Msk
#define DMA_ISR_TCIF5_Pos                                                  (17UL)   /*!<DMA ISR: TCIF5 (Bit 17) */
#define DMA_ISR_TCIF5_Msk                                                  (0x20000UL)    /*!< DMA ISR: TCIF5 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF5                                                      DMA_ISR_TCIF5_Msk
#define DMA_ISR_GIF5_Pos                                                   (16UL)   /*!<DMA ISR: GIF5 (Bit 16) */
#define DMA_ISR_GIF5_Msk                                                   (0x10000UL)    /*!< DMA ISR: GIF5 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF5                                                       DMA_ISR_GIF5_Msk
#define DMA_ISR_TEIF4_Pos                                                  (15UL)   /*!<DMA ISR: TEIF4 (Bit 15) */
#define DMA_ISR_TEIF4_Msk                                                  (0x8000UL)   /*!< DMA ISR: TEIF4 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF4                                                      DMA_ISR_TEIF4_Msk
#define DMA_ISR_HTIF4_Pos                                                  (14UL)   /*!<DMA ISR: HTIF4 (Bit 14) */
#define DMA_ISR_HTIF4_Msk                                                  (0x4000UL)   /*!< DMA ISR: HTIF4 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF4                                                      DMA_ISR_HTIF4_Msk
#define DMA_ISR_TCIF4_Pos                                                  (13UL)   /*!<DMA ISR: TCIF4 (Bit 13) */
#define DMA_ISR_TCIF4_Msk                                                  (0x2000UL)   /*!< DMA ISR: TCIF4 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF4                                                      DMA_ISR_TCIF4_Msk
#define DMA_ISR_GIF4_Pos                                                   (12UL)   /*!<DMA ISR: GIF4 (Bit 12) */
#define DMA_ISR_GIF4_Msk                                                   (0x1000UL)   /*!< DMA ISR: GIF4 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF4                                                       DMA_ISR_GIF4_Msk
#define DMA_ISR_TEIF3_Pos                                                  (11UL)   /*!<DMA ISR: TEIF3 (Bit 11) */
#define DMA_ISR_TEIF3_Msk                                                  (0x800UL)    /*!< DMA ISR: TEIF3 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF3                                                      DMA_ISR_TEIF3_Msk
#define DMA_ISR_HTIF3_Pos                                                  (10UL)   /*!<DMA ISR: HTIF3 (Bit 10) */
#define DMA_ISR_HTIF3_Msk                                                  (0x400UL)    /*!< DMA ISR: HTIF3 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF3                                                      DMA_ISR_HTIF3_Msk
#define DMA_ISR_TCIF3_Pos                                                  (9UL)    /*!<DMA ISR: TCIF3 (Bit 9) */
#define DMA_ISR_TCIF3_Msk                                                  (0x200UL)    /*!< DMA ISR: TCIF3 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF3                                                      DMA_ISR_TCIF3_Msk
#define DMA_ISR_GIF3_Pos                                                   (8UL)    /*!<DMA ISR: GIF3 (Bit 8) */
#define DMA_ISR_GIF3_Msk                                                   (0x100UL)    /*!< DMA ISR: GIF3 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF3                                                       DMA_ISR_GIF3_Msk
#define DMA_ISR_TEIF2_Pos                                                  (7UL)    /*!<DMA ISR: TEIF2 (Bit 7) */
#define DMA_ISR_TEIF2_Msk                                                  (0x80UL)   /*!< DMA ISR: TEIF2 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF2                                                      DMA_ISR_TEIF2_Msk
#define DMA_ISR_HTIF2_Pos                                                  (6UL)    /*!<DMA ISR: HTIF2 (Bit 6) */
#define DMA_ISR_HTIF2_Msk                                                  (0x40UL)   /*!< DMA ISR: HTIF2 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF2                                                      DMA_ISR_HTIF2_Msk
#define DMA_ISR_TCIF2_Pos                                                  (5UL)    /*!<DMA ISR: TCIF2 (Bit 5) */
#define DMA_ISR_TCIF2_Msk                                                  (0x20UL)   /*!< DMA ISR: TCIF2 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF2                                                      DMA_ISR_TCIF2_Msk
#define DMA_ISR_GIF2_Pos                                                   (4UL)    /*!<DMA ISR: GIF2 (Bit 4) */
#define DMA_ISR_GIF2_Msk                                                   (0x10UL)   /*!< DMA ISR: GIF2 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF2                                                       DMA_ISR_GIF2_Msk
#define DMA_ISR_TEIF1_Pos                                                  (3UL)    /*!<DMA ISR: TEIF1 (Bit 3) */
#define DMA_ISR_TEIF1_Msk                                                  (0x8UL)    /*!< DMA ISR: TEIF1 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF1                                                      DMA_ISR_TEIF1_Msk
#define DMA_ISR_HTIF1_Pos                                                  (2UL)    /*!<DMA ISR: HTIF1 (Bit 2) */
#define DMA_ISR_HTIF1_Msk                                                  (0x4UL)    /*!< DMA ISR: HTIF1 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF1                                                      DMA_ISR_HTIF1_Msk
#define DMA_ISR_TCIF1_Pos                                                  (1UL)    /*!<DMA ISR: TCIF1 (Bit 1) */
#define DMA_ISR_TCIF1_Msk                                                  (0x2UL)    /*!< DMA ISR: TCIF1 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF1                                                      DMA_ISR_TCIF1_Msk
#define DMA_ISR_GIF1_Pos                                                   (0UL)    /*!<DMA ISR: GIF1 (Bit 0) */
#define DMA_ISR_GIF1_Msk                                                   (0x1UL)    /*!< DMA ISR: GIF1 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF1                                                       DMA_ISR_GIF1_Msk

