embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    PR    ===================================================== */
#define IWDG_PR_PR_Pos                                                     (0UL)    /*!<IWDG PR: PR (Bit 0) */
#define IWDG_PR_PR_Msk                                                     (0x7UL)    /*!< IWDG PR: PR (Bitfield-Mask: 0x07) */
#define IWDG_PR_PR                                                         IWDG_PR_PR_Msk
#define IWDG_PR_PR_0                                                       (0x1U << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_1                                                       (0x2U << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_2                                                       (0x4U << IWDG_PR_PR_Pos)

/* =====================================================    RLR    ===================================================== */
#define IWDG_RLR_RL_Pos                                                    (0UL)    /*!<IWDG RLR: RL (Bit 0) */
#define IWDG_RLR_RL_Msk                                                    (0xfffUL)    /*!< IWDG RLR: RL (Bitfield-Mask: 0xfff) */
#define IWDG_RLR_RL                                                        IWDG_RLR_RL_Msk
#define IWDG_RLR_RL_0                                                      (0x1U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_1                                                      (0x2U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_2                                                      (0x4U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_3                                                      (0x8U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_4                                                      (0x10U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_5                                                      (0x20U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_6                                                      (0x40U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_7                                                      (0x80U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_8                                                      (0x100U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_9                                                      (0x200U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_10                                                     (0x400U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_11                                                     (0x800U << IWDG_RLR_RL_Pos)

/* =====================================================    SR    ===================================================== */
#define IWDG_SR_WVU_Pos                                                    (2UL)    /*!<IWDG SR: WVU (Bit 2) */
#define IWDG_SR_WVU_Msk                                                    (0x4UL)    /*!< IWDG SR: WVU (Bitfield-Mask: 0x01) */
#define IWDG_SR_WVU                                                        IWDG_SR_WVU_Msk
#define IWDG_SR_RVU_Pos                                                    (1UL)    /*!<IWDG SR: RVU (Bit 1) */
#define IWDG_SR_RVU_Msk                                                    (0x2UL)    /*!< IWDG SR: RVU (Bitfield-Mask: 0x01) */
#define IWDG_SR_RVU                                                        IWDG_SR_RVU_Msk
#define IWDG_SR_PVU_Pos                                                    (0UL)    /*!<IWDG SR: PVU (Bit 0) */
#define IWDG_SR_PVU_Msk                                                    (0x1UL)    /*!< IWDG SR: PVU (Bitfield-Mask: 0x01) */
#define IWDG_SR_PVU                                                        IWDG_SR_PVU_Msk

/* =====================================================    WINR    ===================================================== */
#define IWDG_WINR_WIN_Pos                                                  (0UL)    /*!<IWDG WINR: WIN (Bit 0) */
#define IWDG_WINR_WIN_Msk                                                  (0xfffUL)    /*!< IWDG WINR: WIN (Bitfield-Mask: 0xfff) */
#define IWDG_WINR_WIN                                                      IWDG_WINR_WIN_Msk
#define IWDG_WINR_WIN_0                                                    (0x1U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_1                                                    (0x2U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_2                                                    (0x4U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_3                                                    (0x8U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_4                                                    (0x10U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_5                                                    (0x20U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_6                                                    (0x40U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_7                                                    (0x80U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_8                                                    (0x100U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_9                                                    (0x200U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_10                                                   (0x400U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_11                                                   (0x800U << IWDG_WINR_WIN_Pos)


/* =========================================================================================================================== */
/*=====================                                       I2C                                       ===================== */
/* =========================================================================================================================== */

/* =====================================================    CR1    ===================================================== */
#define I2C_CR1_PECEN_Pos                                                  (23UL)                             /*!<I2C CR1: PECEN (Bit 23) */
#define I2C_CR1_PECEN_Msk                                                  (0x1UL << I2C_CR1_PECEN_Pos)       /*!< I2C CR1: PECEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_PECEN                                                      I2C_CR1_PECEN_Msk
#define I2C_CR1_ALERTEN_Pos                                                (22UL)                             /*!<I2C CR1: ALERTEN (Bit 22) */
#define I2C_CR1_ALERTEN_Msk                                                (0x1UL << I2C_CR1_ALERTEN_Pos)     /*!< I2C CR1: ALERTEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_ALERTEN                                                    I2C_CR1_ALERTEN_Msk
#define I2C_CR1_SMBDEN_Pos                                                 (21UL)                             /*!<I2C CR1: SMBDEN (Bit 21) */
#define I2C_CR1_SMBDEN_Msk                                                 (0x1UL << I2C_CR1_SMBDEN_Pos)      /*!< I2C CR1: SMBDEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_SMBDEN                                                     I2C_CR1_SMBDEN_Msk
#define I2C_CR1_SMBHEN_Pos                                                 (20UL)                             /*!<I2C CR1: SMBHEN (Bit 20) */
#define I2C_CR1_SMBHEN_Msk                                                 (0x1UL << I2C_CR1_SMBHEN_Pos)      /*!< I2C CR1: SMBHEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_SMBHEN                                                     I2C_CR1_SMBHEN_Msk
#define I2C_CR1_GCEN_Pos                                                   (19UL)                             /*!<I2C CR1: GCEN (Bit 19) */
#define I2C_CR1_GCEN_Msk                                                   (0x1UL << I2C_CR1_GCEN_Pos)        /*!< I2C CR1: GCEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_GCEN                                                       I2C_CR1_GCEN_Msk
#define I2C_CR1_NOSTRETCH_Pos                                              (17UL)                             /*!<I2C CR1: NOSTRETCH (Bit 17) */
#define I2C_CR1_NOSTRETCH_Msk                                              (0x1UL << I2C_CR1_NOSTRETCH_Pos)   /*!< I2C CR1: NOSTRETCH (Bitfield-Mask: 0x01) */
#define I2C_CR1_NOSTRETCH                                                  I2C_CR1_NOSTRETCH_Msk
#define I2C_CR1_SBC_Pos                                                    (16UL)                             /*!<I2C CR1: SBC (Bit 16) */
#define I2C_CR1_SBC_Msk                                                    (0x1UL << I2C_CR1_SBC_Pos)         /*!< I2C CR1: SBC (Bitfield-Mask: 0x01) */
#define I2C_CR1_SBC                                                        I2C_CR1_SBC_Msk
#define I2C_CR1_RXDMAEN_Pos                                                (15UL)                             /*!<I2C CR1: RXDMAEN (Bit 15) */
#define I2C_CR1_RXDMAEN_Msk                                                (0x1UL << I2C_CR1_RXDMAEN_Pos)     /*!< I2C CR1: RXDMAEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_RXDMAEN                                                    I2C_CR1_RXDMAEN_Msk
#define I2C_CR1_TXDMAEN_Pos                                                (14UL)                             /*!<I2C CR1: TXDMAEN (Bit 14) */
#define I2C_CR1_TXDMAEN_Msk                                                (0x1UL << I2C_CR1_TXDMAEN_Pos)     /*!< I2C CR1: TXDMAEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_TXDMAEN                                                    I2C_CR1_TXDMAEN_Msk
#define I2C_CR1_ANFOFF_Pos                                                 (12UL)                             /*!<I2C CR1: ANFOFF (Bit 12) */
#define I2C_CR1_ANFOFF_Msk                                                 (0x1UL << I2C_CR1_ANFOFF_Pos)      /*!< I2C CR1: ANFOFF (Bitfield-Mask: 0x01) */
#define I2C_CR1_ANFOFF                                                     I2C_CR1_ANFOFF_Msk
#define I2C_CR1_DNF_Pos                                                    (8UL)                              /*!<I2C CR1: DNF (Bit 8) */
#define I2C_CR1_DNF_Msk                                                    (0xFUL << I2C_CR1_DNF_Pos)         /*!< I2C CR1: DNF (Bitfield-Mask: 0x0f) */
#define I2C_CR1_DNF                                                        I2C_CR1_DNF_Msk
#define I2C_CR1_DNF_0                                                      (0x1U << I2C_CR1_DNF_Pos)
#define I2C_CR1_DNF_1                                                      (0x2U << I2C_CR1_DNF_Pos)
#define I2C_CR1_DNF_2                                                      (0x4U << I2C_CR1_DNF_Pos)
#define I2C_CR1_DNF_3                                                      (0x8U << I2C_CR1_DNF_Pos)
#define I2C_CR1_ERRIE_Pos                                                  (7UL)                              /*!<I2C CR1: ERRIE (Bit 7) */
#define I2C_CR1_ERRIE_Msk                                                  (0x1UL << I2C_CR1_ERRIE_Pos)       /*!< I2C CR1: ERRIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_ERRIE                                                      I2C_CR1_ERRIE_Msk
#define I2C_CR1_TCIE_Pos                                                   (6UL)                              /*!<I2C CR1: TCIE (Bit 6) */
#define I2C_CR1_TCIE_Msk                                                   (0x1UL << I2C_CR1_TCIE_Pos)        /*!< I2C CR1: TCIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_TCIE                                                       I2C_CR1_TCIE_Msk
#define I2C_CR1_STOPIE_Pos                                                 (5UL)                              /*!<I2C CR1: STOPIE (Bit 5) */
#define I2C_CR1_STOPIE_Msk                                                 (0x1UL << I2C_CR1_STOPIE_Pos)      /*!< I2C CR1: STOPIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_STOPIE                                                     I2C_CR1_STOPIE_Msk
#define I2C_CR1_NACKIE_Pos                                                 (4UL)                              /*!<I2C CR1: NACKIE (Bit 4) */
#define I2C_CR1_NACKIE_Msk                                                 (0x1UL << I2C_CR1_NACKIE_Pos)      /*!< I2C CR1: NACKIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_NACKIE                                                     I2C_CR1_NACKIE_Msk
#define I2C_CR1_ADDRIE_Pos                                                 (3UL)                              /*!<I2C CR1: ADDRIE (Bit 3) */
#define I2C_CR1_ADDRIE_Msk                                                 (0x1UL << I2C_CR1_ADDRIE_Pos)      /*!< I2C CR1: ADDRIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_ADDRIE                                                     I2C_CR1_ADDRIE_Msk
#define I2C_CR1_RXIE_Pos                                                   (2UL)                              /*!<I2C CR1: RXIE (Bit 2) */
#define I2C_CR1_RXIE_Msk                                                   (0x1UL << I2C_CR1_RXIE_Pos)        /*!< I2C CR1: RXIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_RXIE                                                       I2C_CR1_RXIE_Msk
#define I2C_CR1_TXIE_Pos                                                   (1UL)                              /*!<I2C CR1: TXIE (Bit 1) */
#define I2C_CR1_TXIE_Msk                                                   (0x1UL << I2C_CR1_TXIE_Pos)        /*!< I2C CR1: TXIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_TXIE                                                       I2C_CR1_TXIE_Msk
#define I2C_CR1_PE_Pos                                                     (0UL)                              /*!<I2C CR1: PE (Bit 0) */
#define I2C_CR1_PE_Msk                                                     (0x1UL << I2C_CR1_PE_Pos)          /*!< I2C CR1: PE (Bitfield-Mask: 0x01) */
#define I2C_CR1_PE                                                         I2C_CR1_PE_Msk

