embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    COMMAND    ===================================================== */
#define FLASH_COMMAND_COMMAND_Pos                                          (0UL)    /*!<FLASH COMMAND: COMMAND (Bit 0) */
#define FLASH_COMMAND_COMMAND_Msk                                          (0xffUL)   /*!< FLASH COMMAND: COMMAND (Bitfield-Mask: 0xff) */
#define FLASH_COMMAND_COMMAND                                              FLASH_COMMAND_COMMAND_Msk
#define FLASH_COMMAND_COMMAND_0                                            (0x1U << FLASH_COMMAND_COMMAND_Pos)
#define FLASH_COMMAND_COMMAND_1                                            (0x2U << FLASH_COMMAND_COMMAND_Pos)
#define FLASH_COMMAND_COMMAND_2                                            (0x4U << FLASH_COMMAND_COMMAND_Pos)
#define FLASH_COMMAND_COMMAND_3                                            (0x8U << FLASH_COMMAND_COMMAND_Pos)
#define FLASH_COMMAND_COMMAND_4                                            (0x10U << FLASH_COMMAND_COMMAND_Pos)
#define FLASH_COMMAND_COMMAND_5                                            (0x20U << FLASH_COMMAND_COMMAND_Pos)
#define FLASH_COMMAND_COMMAND_6                                            (0x40U << FLASH_COMMAND_COMMAND_Pos)
#define FLASH_COMMAND_COMMAND_7                                            (0x80U << FLASH_COMMAND_COMMAND_Pos)

/* =====================================================    CONFIG    ===================================================== */
#define FLASH_CONFIG_WAIT_STATES_Pos                                       (4UL)    /*!<FLASH CONFIG: WAIT_STATES (Bit 4) */
#define FLASH_CONFIG_WAIT_STATES_Msk                                       (0x30UL)   /*!< FLASH CONFIG: WAIT_STATES (Bitfield-Mask: 0x03) */
#define FLASH_CONFIG_WAIT_STATES                                           FLASH_CONFIG_WAIT_STATES_Msk
#define FLASH_CONFIG_WAIT_STATES_0                                         (0x1U << FLASH_CONFIG_WAIT_STATES_Pos)
#define FLASH_CONFIG_WAIT_STATES_1                                         (0x2U << FLASH_CONFIG_WAIT_STATES_Pos)
#define FLASH_CONFIG_DIS_GROUP_WRITE_Pos                                   (2UL)    /*!<FLASH CONFIG: DIS_GROUP_WRITE (Bit 2) */
#define FLASH_CONFIG_DIS_GROUP_WRITE_Msk                                   (0x4UL)    /*!< FLASH CONFIG: DIS_GROUP_WRITE (Bitfield-Mask: 0x01) */
#define FLASH_CONFIG_DIS_GROUP_WRITE                                       FLASH_CONFIG_DIS_GROUP_WRITE_Msk
#define FLASH_CONFIG_REMAP_Pos                                             (1UL)    /*!<FLASH CONFIG: REMAP (Bit 1) */
#define FLASH_CONFIG_REMAP_Msk                                             (0x2UL)    /*!< FLASH CONFIG: REMAP (Bitfield-Mask: 0x01) */
#define FLASH_CONFIG_REMAP                                                 FLASH_CONFIG_REMAP_Msk

/* =====================================================    IRQSTAT    ===================================================== */
#define FLASH_IRQSTAT_READOK_MIS_Pos                                       (4UL)    /*!<FLASH IRQSTAT: READOK_MIS (Bit 4) */
#define FLASH_IRQSTAT_READOK_MIS_Msk                                       (0x10UL)   /*!< FLASH IRQSTAT: READOK_MIS (Bitfield-Mask: 0x01) */
#define FLASH_IRQSTAT_READOK_MIS                                           FLASH_IRQSTAT_READOK_MIS_Msk
#define FLASH_IRQSTAT_ILLCMD_MIS_Pos                                       (3UL)    /*!<FLASH IRQSTAT: ILLCMD_MIS (Bit 3) */
#define FLASH_IRQSTAT_ILLCMD_MIS_Msk                                       (0x8UL)    /*!< FLASH IRQSTAT: ILLCMD_MIS (Bitfield-Mask: 0x01) */
#define FLASH_IRQSTAT_ILLCMD_MIS                                           FLASH_IRQSTAT_ILLCMD_MIS_Msk
#define FLASH_IRQSTAT_CMDERR_MIS_Pos                                       (2UL)    /*!<FLASH IRQSTAT: CMDERR_MIS (Bit 2) */
#define FLASH_IRQSTAT_CMDERR_MIS_Msk                                       (0x4UL)    /*!< FLASH IRQSTAT: CMDERR_MIS (Bitfield-Mask: 0x01) */
#define FLASH_IRQSTAT_CMDERR_MIS                                           FLASH_IRQSTAT_CMDERR_MIS_Msk
#define FLASH_IRQSTAT_CMDSTART_MIS_Pos                                     (1UL)    /*!<FLASH IRQSTAT: CMDSTART_MIS (Bit 1) */
#define FLASH_IRQSTAT_CMDSTART_MIS_Msk                                     (0x2UL)    /*!< FLASH IRQSTAT: CMDSTART_MIS (Bitfield-Mask: 0x01) */
#define FLASH_IRQSTAT_CMDSTART_MIS                                         FLASH_IRQSTAT_CMDSTART_MIS_Msk
#define FLASH_IRQSTAT_CMDDONE_MIS_Pos                                      (0UL)    /*!<FLASH IRQSTAT: CMDDONE_MIS (Bit 0) */
#define FLASH_IRQSTAT_CMDDONE_MIS_Msk                                      (0x1UL)    /*!< FLASH IRQSTAT: CMDDONE_MIS (Bitfield-Mask: 0x01) */
#define FLASH_IRQSTAT_CMDDONE_MIS                                          FLASH_IRQSTAT_CMDDONE_MIS_Msk

/* =====================================================    IRQMASK    ===================================================== */
#define FLASH_IRQMASK_READOKM_Pos                                          (4UL)    /*!<FLASH IRQMASK: READOKM (Bit 4) */
#define FLASH_IRQMASK_READOKM_Msk                                          (0x10UL)   /*!< FLASH IRQMASK: READOKM (Bitfield-Mask: 0x01) */
#define FLASH_IRQMASK_READOKM                                              FLASH_IRQMASK_READOKM_Msk
#define FLASH_IRQMASK_ILLCMDM_Pos                                          (3UL)    /*!<FLASH IRQMASK: ILLCMDM (Bit 3) */
#define FLASH_IRQMASK_ILLCMDM_Msk                                          (0x8UL)    /*!< FLASH IRQMASK: ILLCMDM (Bitfield-Mask: 0x01) */
#define FLASH_IRQMASK_ILLCMDM                                              FLASH_IRQMASK_ILLCMDM_Msk
#define FLASH_IRQMASK_CMDERRM_Pos                                          (2UL)    /*!<FLASH IRQMASK: CMDERRM (Bit 2) */
#define FLASH_IRQMASK_CMDERRM_Msk                                          (0x4UL)    /*!< FLASH IRQMASK: CMDERRM (Bitfield-Mask: 0x01) */
#define FLASH_IRQMASK_CMDERRM                                              FLASH_IRQMASK_CMDERRM_Msk
#define FLASH_IRQMASK_CMDSTARTM_Pos                                        (1UL)    /*!<FLASH IRQMASK: CMDSTARTM (Bit 1) */
#define FLASH_IRQMASK_CMDSTARTM_Msk                                        (0x2UL)    /*!< FLASH IRQMASK: CMDSTARTM (Bitfield-Mask: 0x01) */
#define FLASH_IRQMASK_CMDSTARTM                                            FLASH_IRQMASK_CMDSTARTM_Msk
#define FLASH_IRQMASK_CMDDONEM_Pos                                         (0UL)    /*!<FLASH IRQMASK: CMDDONEM (Bit 0) */
#define FLASH_IRQMASK_CMDDONEM_Msk                                         (0x1UL)    /*!< FLASH IRQMASK: CMDDONEM (Bitfield-Mask: 0x01) */
#define FLASH_IRQMASK_CMDDONEM                                             FLASH_IRQMASK_CMDDONEM_Msk

