embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    CR5    ===================================================== */
#define PWR_CR5_SMPS_PRECH_CUR_SEL_Pos                                     (13UL)   /*!<PWR CR5: SMPS_PRECH_CUR_SEL (Bit 13) */
#define PWR_CR5_SMPS_PRECH_CUR_SEL_Msk                                     (0x6000UL)   /*!< PWR CR5: SMPS_PRECH_CUR_SEL (Bitfield-Mask: 0x03) */
#define PWR_CR5_SMPS_PRECH_CUR_SEL                                         PWR_CR5_SMPS_PRECH_CUR_SEL_Msk
#define PWR_CR5_SMPS_PRECH_CUR_SEL_0                                       (0x1U << PWR_CR5_SMPS_PRECH_CUR_SEL_Pos)
#define PWR_CR5_SMPS_PRECH_CUR_SEL_1                                       (0x2U << PWR_CR5_SMPS_PRECH_CUR_SEL_Pos)
#define PWR_CR5_CLKDETR_DISABLE_Pos                                        (12UL)   /*!<PWR CR5: CLKDETR_DISABLE (Bit 12) */
#define PWR_CR5_CLKDETR_DISABLE_Msk                                        (0x1000UL)   /*!< PWR CR5: CLKDETR_DISABLE (Bitfield-Mask: 0x01) */
#define PWR_CR5_CLKDETR_DISABLE                                            PWR_CR5_CLKDETR_DISABLE_Msk
#define PWR_CR5_SMPS_ENA_DCM_Pos                                           (11UL)   /*!<PWR CR5: SMPS_ENA_DCM (Bit 11) */
#define PWR_CR5_SMPS_ENA_DCM_Msk                                           (0x800UL)    /*!< PWR CR5: SMPS_ENA_DCM (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPS_ENA_DCM                                               PWR_CR5_SMPS_ENA_DCM_Msk
#define PWR_CR5_NOSMPS_Pos                                                 (10UL)   /*!<PWR CR5: NOSMPS (Bit 10) */
#define PWR_CR5_NOSMPS_Msk                                                 (0x400UL)    /*!< PWR CR5: NOSMPS (Bitfield-Mask: 0x01) */
#define PWR_CR5_NOSMPS                                                     PWR_CR5_NOSMPS_Msk
#define PWR_CR5_SMPSFBYP_Pos                                               (9UL)    /*!<PWR CR5: SMPSFBYP (Bit 9) */
#define PWR_CR5_SMPSFBYP_Msk                                               (0x200UL)    /*!< PWR CR5: SMPSFBYP (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPSFBYP                                                   PWR_CR5_SMPSFBYP_Msk
#define PWR_CR5_SMPSLPOPEN_Pos                                             (8UL)    /*!<PWR CR5: SMPSLPOPEN (Bit 8) */
#define PWR_CR5_SMPSLPOPEN_Msk                                             (0x100UL)    /*!< PWR CR5: SMPSLPOPEN (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPSLPOPEN                                                 PWR_CR5_SMPSLPOPEN_Msk
#define PWR_CR5_SMPSFRDY_Pos                                               (7UL)    /*!<PWR CR5: SMPSFRDY (Bit 7) */
#define PWR_CR5_SMPSFRDY_Msk                                               (0x80UL)   /*!< PWR CR5: SMPSFRDY (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPSFRDY                                                   PWR_CR5_SMPSFRDY_Msk
#define PWR_CR5_SMPSBOMSEL_Pos                                             (4UL)    /*!<PWR CR5: SMPSBOMSEL (Bit 4) */
#define PWR_CR5_SMPSBOMSEL_Msk                                             (0x30UL)   /*!< PWR CR5: SMPSBOMSEL (Bitfield-Mask: 0x03) */
#define PWR_CR5_SMPSBOMSEL                                                 PWR_CR5_SMPSBOMSEL_Msk
#define PWR_CR5_SMPSBOMSEL_0                                               (0x1U << PWR_CR5_SMPSBOMSEL_Pos)
#define PWR_CR5_SMPSBOMSEL_1                                               (0x2U << PWR_CR5_SMPSBOMSEL_Pos)
#define PWR_CR5_SMPSLVL_Pos                                                (0UL)    /*!<PWR CR5: SMPSLVL (Bit 0) */
#define PWR_CR5_SMPSLVL_Msk                                                (0xfUL)    /*!< PWR CR5: SMPSLVL (Bitfield-Mask: 0x0f) */
#define PWR_CR5_SMPSLVL                                                    PWR_CR5_SMPSLVL_Msk
#define PWR_CR5_SMPSLVL_0                                                  (0x1U << PWR_CR5_SMPSLVL_Pos)
#define PWR_CR5_SMPSLVL_1                                                  (0x2U << PWR_CR5_SMPSLVL_Pos)
#define PWR_CR5_SMPSLVL_2                                                  (0x4U << PWR_CR5_SMPSLVL_Pos)
#define PWR_CR5_SMPSLVL_3                                                  (0x8U << PWR_CR5_SMPSLVL_Pos)

/* =====================================================    PUCRA    ===================================================== */
#define PWR_PUCRA_PA11_Pos                                                 (11UL)   /*!<PWR PUCRA: PA11 (Bit 11) */
#define PWR_PUCRA_PA11_Msk                                                 (0x800UL)    /*!< PWR PUCRA: PA11 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA11                                                     PWR_PUCRA_PA11_Msk
#define PWR_PUCRA_PA10_Pos                                                 (10UL)   /*!<PWR PUCRA: PA10 (Bit 10) */
#define PWR_PUCRA_PA10_Msk                                                 (0x400UL)    /*!< PWR PUCRA: PA10 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA10                                                     PWR_PUCRA_PA10_Msk
#define PWR_PUCRA_PA9_Pos                                                  (9UL)    /*!<PWR PUCRA: PA9 (Bit 9) */
#define PWR_PUCRA_PA9_Msk                                                  (0x200UL)    /*!< PWR PUCRA: PA9 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA9                                                      PWR_PUCRA_PA9_Msk
#define PWR_PUCRA_PA8_Pos                                                  (8UL)    /*!<PWR PUCRA: PA8 (Bit 8) */
#define PWR_PUCRA_PA8_Msk                                                  (0x100UL)    /*!< PWR PUCRA: PA8 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA8                                                      PWR_PUCRA_PA8_Msk
#define PWR_PUCRA_PA3_Pos                                                  (3UL)    /*!<PWR PUCRA: PA3 (Bit 3) */
#define PWR_PUCRA_PA3_Msk                                                  (0x8UL)    /*!< PWR PUCRA: PA3 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA3                                                      PWR_PUCRA_PA3_Msk
#define PWR_PUCRA_PA2_Pos                                                  (2UL)    /*!<PWR PUCRA: PA2 (Bit 2) */
#define PWR_PUCRA_PA2_Msk                                                  (0x4UL)    /*!< PWR PUCRA: PA2 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA2                                                      PWR_PUCRA_PA2_Msk
#define PWR_PUCRA_PA1_Pos                                                  (1UL)    /*!<PWR PUCRA: PA1 (Bit 1) */
#define PWR_PUCRA_PA1_Msk                                                  (0x2UL)    /*!< PWR PUCRA: PA1 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA1                                                      PWR_PUCRA_PA1_Msk
#define PWR_PUCRA_PA0_Pos                                                  (0UL)    /*!<PWR PUCRA: PA0 (Bit 0) */
#define PWR_PUCRA_PA0_Msk                                                  (0x1UL)    /*!< PWR PUCRA: PA0 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA0                                                      PWR_PUCRA_PA0_Msk

/* =====================================================    PDCRA    ===================================================== */
#define PWR_PDCRA_PA11_Pos                                                 (11UL)   /*!<PWR PDCRA: PA11 (Bit 11) */
#define PWR_PDCRA_PA11_Msk                                                 (0x800UL)    /*!< PWR PDCRA: PA11 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA11                                                     PWR_PDCRA_PA11_Msk
#define PWR_PDCRA_PA10_Pos                                                 (10UL)   /*!<PWR PDCRA: PA10 (Bit 10) */
#define PWR_PDCRA_PA10_Msk                                                 (0x400UL)    /*!< PWR PDCRA: PA10 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA10                                                     PWR_PDCRA_PA10_Msk
#define PWR_PDCRA_PA9_Pos                                                  (9UL)    /*!<PWR PDCRA: PA9 (Bit 9) */
#define PWR_PDCRA_PA9_Msk                                                  (0x200UL)    /*!< PWR PDCRA: PA9 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA9                                                      PWR_PDCRA_PA9_Msk
#define PWR_PDCRA_PA8_Pos                                                  (8UL)    /*!<PWR PDCRA: PA8 (Bit 8) */
#define PWR_PDCRA_PA8_Msk                                                  (0x100UL)    /*!< PWR PDCRA: PA8 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA8                                                      PWR_PDCRA_PA8_Msk
#define PWR_PDCRA_PA3_Pos                                                  (3UL)    /*!<PWR PDCRA: PA3 (Bit 3) */
#define PWR_PDCRA_PA3_Msk                                                  (0x8UL)    /*!< PWR PDCRA: PA3 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA3                                                      PWR_PDCRA_PA3_Msk
#define PWR_PDCRA_PA2_Pos                                                  (2UL)    /*!<PWR PDCRA: PA2 (Bit 2) */
#define PWR_PDCRA_PA2_Msk                                                  (0x4UL)    /*!< PWR PDCRA: PA2 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA2                                                      PWR_PDCRA_PA2_Msk
#define PWR_PDCRA_PA1_Pos                                                  (1UL)    /*!<PWR PDCRA: PA1 (Bit 1) */
#define PWR_PDCRA_PA1_Msk                                                  (0x2UL)    /*!< PWR PDCRA: PA1 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA1                                                      PWR_PDCRA_PA1_Msk
#define PWR_PDCRA_PA0_Pos                                                  (0UL)    /*!<PWR PDCRA: PA0 (Bit 0) */
#define PWR_PDCRA_PA0_Msk                                                  (0x1UL)    /*!< PWR PDCRA: PA0 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA0                                                      PWR_PDCRA_PA0_Msk

/* =====================================================    PUCRB    ===================================================== */
#define PWR_PUCRB_PB15_Pos                                                 (15UL)   /*!<PWR PUCRB: PB15 (Bit 15) */
#define PWR_PUCRB_PB15_Msk                                                 (0x8000UL)   /*!< PWR PUCRB: PB15 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB15                                                     PWR_PUCRB_PB15_Msk
#define PWR_PUCRB_PB14_Pos                                                 (14UL)   /*!<PWR PUCRB: PB14 (Bit 14) */
#define PWR_PUCRB_PB14_Msk                                                 (0x4000UL)   /*!< PWR PUCRB: PB14 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB14                                                     PWR_PUCRB_PB14_Msk
#define PWR_PUCRB_PB13_Pos                                                 (13UL)   /*!<PWR PUCRB: PB13 (Bit 13) */
#define PWR_PUCRB_PB13_Msk                                                 (0x2000UL)   /*!< PWR PUCRB: PB13 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB13                                                     PWR_PUCRB_PB13_Msk
#define PWR_PUCRB_PB12_Pos                                                 (12UL)   /*!<PWR PUCRB: PB12 (Bit 12) */
#define PWR_PUCRB_PB12_Msk                                                 (0x1000UL)   /*!< PWR PUCRB: PB12 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB12                                                     PWR_PUCRB_PB12_Msk
#define PWR_PUCRB_PB7_Pos                                                  (7UL)    /*!<PWR PUCRB: PB7 (Bit 7) */
#define PWR_PUCRB_PB7_Msk                                                  (0x80UL)   /*!< PWR PUCRB: PB7 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB7                                                      PWR_PUCRB_PB7_Msk
#define PWR_PUCRB_PB6_Pos                                                  (6UL)    /*!<PWR PUCRB: PB6 (Bit 6) */
#define PWR_PUCRB_PB6_Msk                                                  (0x40UL)   /*!< PWR PUCRB: PB6 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB6                                                      PWR_PUCRB_PB6_Msk
#define PWR_PUCRB_PB5_Pos                                                  (5UL)    /*!<PWR PUCRB: PB5 (Bit 5) */
#define PWR_PUCRB_PB5_Msk                                                  (0x20UL)   /*!< PWR PUCRB: PB5 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB5                                                      PWR_PUCRB_PB5_Msk
#define PWR_PUCRB_PB4_Pos                                                  (4UL)    /*!<PWR PUCRB: PB4 (Bit 4) */
#define PWR_PUCRB_PB4_Msk                                                  (0x10UL)   /*!< PWR PUCRB: PB4 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB4                                                      PWR_PUCRB_PB4_Msk
#define PWR_PUCRB_PB3_Pos                                                  (3UL)    /*!<PWR PUCRB: PB3 (Bit 3) */
#define PWR_PUCRB_PB3_Msk                                                  (0x8UL)    /*!< PWR PUCRB: PB3 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB3                                                      PWR_PUCRB_PB3_Msk
#define PWR_PUCRB_PB2_Pos                                                  (2UL)    /*!<PWR PUCRB: PB2 (Bit 2) */
#define PWR_PUCRB_PB2_Msk                                                  (0x4UL)    /*!< PWR PUCRB: PB2 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB2                                                      PWR_PUCRB_PB2_Msk
#define PWR_PUCRB_PB1_Pos                                                  (1UL)    /*!<PWR PUCRB: PB1 (Bit 1) */
#define PWR_PUCRB_PB1_Msk                                                  (0x2UL)    /*!< PWR PUCRB: PB1 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB1                                                      PWR_PUCRB_PB1_Msk
#define PWR_PUCRB_PB0_Pos                                                  (0UL)    /*!<PWR PUCRB: PB0 (Bit 0) */
#define PWR_PUCRB_PB0_Msk                                                  (0x1UL)    /*!< PWR PUCRB: PB0 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB0                                                      PWR_PUCRB_PB0_Msk

/* =====================================================    PDCRB    ===================================================== */
#define PWR_PDCRB_PB15_Pos                                                 (15UL)   /*!<PWR PDCRB: PB15 (Bit 15) */
#define PWR_PDCRB_PB15_Msk                                                 (0x8000UL)   /*!< PWR PDCRB: PB15 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB15                                                     PWR_PDCRB_PB15_Msk
#define PWR_PDCRB_PB14_Pos                                                 (14UL)   /*!<PWR PDCRB: PB14 (Bit 14) */
#define PWR_PDCRB_PB14_Msk                                                 (0x4000UL)   /*!< PWR PDCRB: PB14 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB14                                                     PWR_PDCRB_PB14_Msk
#define PWR_PDCRB_PB13_Pos                                                 (13UL)   /*!<PWR PDCRB: PB13 (Bit 13) */
#define PWR_PDCRB_PB13_Msk                                                 (0x2000UL)   /*!< PWR PDCRB: PB13 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB13                                                     PWR_PDCRB_PB13_Msk
#define PWR_PDCRB_PB12_Pos                                                 (12UL)   /*!<PWR PDCRB: PB12 (Bit 12) */
#define PWR_PDCRB_PB12_Msk                                                 (0x1000UL)   /*!< PWR PDCRB: PB12 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB12                                                     PWR_PDCRB_PB12_Msk
#define PWR_PDCRB_PB7_Pos                                                  (7UL)    /*!<PWR PDCRB: PB7 (Bit 7) */
#define PWR_PDCRB_PB7_Msk                                                  (0x80UL)   /*!< PWR PDCRB: PB7 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB7                                                      PWR_PDCRB_PB7_Msk
#define PWR_PDCRB_PB6_Pos                                                  (6UL)    /*!<PWR PDCRB: PB6 (Bit 6) */
#define PWR_PDCRB_PB6_Msk                                                  (0x40UL)   /*!< PWR PDCRB: PB6 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB6                                                      PWR_PDCRB_PB6_Msk
#define PWR_PDCRB_PB5_Pos                                                  (5UL)    /*!<PWR PDCRB: PB5 (Bit 5) */
#define PWR_PDCRB_PB5_Msk                                                  (0x20UL)   /*!< PWR PDCRB: PB5 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB5                                                      PWR_PDCRB_PB5_Msk
#define PWR_PDCRB_PB4_Pos                                                  (4UL)    /*!<PWR PDCRB: PB4 (Bit 4) */
#define PWR_PDCRB_PB4_Msk                                                  (0x10UL)   /*!< PWR PDCRB: PB4 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB4                                                      PWR_PDCRB_PB4_Msk
#define PWR_PDCRB_PB3_Pos                                                  (3UL)    /*!<PWR PDCRB: PB3 (Bit 3) */
#define PWR_PDCRB_PB3_Msk                                                  (0x8UL)    /*!< PWR PDCRB: PB3 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB3                                                      PWR_PDCRB_PB3_Msk
#define PWR_PDCRB_PB2_Pos                                                  (2UL)    /*!<PWR PDCRB: PB2 (Bit 2) */
#define PWR_PDCRB_PB2_Msk                                                  (0x4UL)    /*!< PWR PDCRB: PB2 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB2                                                      PWR_PDCRB_PB2_Msk
#define PWR_PDCRB_PB1_Pos                                                  (1UL)    /*!<PWR PDCRB: PB1 (Bit 1) */
#define PWR_PDCRB_PB1_Msk                                                  (0x2UL)    /*!< PWR PDCRB: PB1 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB1                                                      PWR_PDCRB_PB1_Msk
#define PWR_PDCRB_PB0_Pos                                                  (0UL)    /*!<PWR PDCRB: PB0 (Bit 0) */
#define PWR_PDCRB_PB0_Msk                                                  (0x1UL)    /*!< PWR PDCRB: PB0 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB0                                                      PWR_PDCRB_PB0_Msk

/* =====================================================    CR6    ===================================================== */
#define PWR_CR6_EWU19_Pos                                                  (7UL)    /*!<PWR CR6: EWU19 (Bit 7) */
#define PWR_CR6_EWU19_Msk                                                  (0x80UL)   /*!< PWR CR6: EWU19 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU19                                                      PWR_CR6_EWU19_Msk
#define PWR_CR6_EWU18_Pos                                                  (6UL)    /*!<PWR CR6: EWU18 (Bit 6) */
#define PWR_CR6_EWU18_Msk                                                  (0x40UL)   /*!< PWR CR6: EWU18 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU18                                                      PWR_CR6_EWU18_Msk
#define PWR_CR6_EWU17_Pos                                                  (5UL)    /*!<PWR CR6: EWU17 (Bit 5) */
#define PWR_CR6_EWU17_Msk                                                  (0x20UL)   /*!< PWR CR6: EWU17 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU17                                                      PWR_CR6_EWU17_Msk
#define PWR_CR6_EWU16_Pos                                                  (4UL)    /*!<PWR CR6: EWU16 (Bit 4) */
#define PWR_CR6_EWU16_Msk                                                  (0x10UL)   /*!< PWR CR6: EWU16 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU16                                                      PWR_CR6_EWU16_Msk
#define PWR_CR6_EWU15_Pos                                                  (3UL)    /*!<PWR CR6: EWU15 (Bit 3) */
#define PWR_CR6_EWU15_Msk                                                  (0x8UL)    /*!< PWR CR6: EWU15 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU15                                                      PWR_CR6_EWU15_Msk
#define PWR_CR6_EWU14_Pos                                                  (2UL)    /*!<PWR CR6: EWU14 (Bit 2) */
#define PWR_CR6_EWU14_Msk                                                  (0x4UL)    /*!< PWR CR6: EWU14 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU14                                                      PWR_CR6_EWU14_Msk
#define PWR_CR6_EWU13_Pos                                                  (1UL)    /*!<PWR CR6: EWU13 (Bit 1) */
#define PWR_CR6_EWU13_Msk                                                  (0x2UL)    /*!< PWR CR6: EWU13 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU13                                                      PWR_CR6_EWU13_Msk
#define PWR_CR6_EWU12_Pos                                                  (0UL)    /*!<PWR CR6: EWU12 (Bit 0) */
#define PWR_CR6_EWU12_Msk                                                  (0x1UL)    /*!< PWR CR6: EWU12 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU12                                                      PWR_CR6_EWU12_Msk

/* =====================================================    CR7    ===================================================== */
#define PWR_CR7_WUP19_Pos                                                  (7UL)    /*!<PWR CR7: WUP19 (Bit 7) */
#define PWR_CR7_WUP19_Msk                                                  (0x80UL)   /*!< PWR CR7: WUP19 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP19                                                      PWR_CR7_WUP19_Msk
#define PWR_CR7_WUP18_Pos                                                  (6UL)    /*!<PWR CR7: WUP18 (Bit 6) */
#define PWR_CR7_WUP18_Msk                                                  (0x40UL)   /*!< PWR CR7: WUP18 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP18                                                      PWR_CR7_WUP18_Msk
#define PWR_CR7_WUP17_Pos                                                  (5UL)    /*!<PWR CR7: WUP17 (Bit 5) */
#define PWR_CR7_WUP17_Msk                                                  (0x20UL)   /*!< PWR CR7: WUP17 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP17                                                      PWR_CR7_WUP17_Msk
#define PWR_CR7_WUP16_Pos                                                  (4UL)    /*!<PWR CR7: WUP16 (Bit 4) */
#define PWR_CR7_WUP16_Msk                                                  (0x10UL)   /*!< PWR CR7: WUP16 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP16                                                      PWR_CR7_WUP16_Msk
#define PWR_CR7_WUP15_Pos                                                  (3UL)    /*!<PWR CR7: WUP15 (Bit 3) */
#define PWR_CR7_WUP15_Msk                                                  (0x8UL)    /*!< PWR CR7: WUP15 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP15                                                      PWR_CR7_WUP15_Msk
#define PWR_CR7_WUP14_Pos                                                  (2UL)    /*!<PWR CR7: WUP14 (Bit 2) */
#define PWR_CR7_WUP14_Msk                                                  (0x4UL)    /*!< PWR CR7: WUP14 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP14                                                      PWR_CR7_WUP14_Msk
#define PWR_CR7_WUP13_Pos                                                  (1UL)    /*!<PWR CR7: WUP13 (Bit 1) */
#define PWR_CR7_WUP13_Msk                                                  (0x2UL)    /*!< PWR CR7: WUP13 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP13                                                      PWR_CR7_WUP13_Msk
#define PWR_CR7_WUP12_Pos                                                  (0UL)    /*!<PWR CR7: WUP12 (Bit 0) */
#define PWR_CR7_WUP12_Msk                                                  (0x1UL)    /*!< PWR CR7: WUP12 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP12                                                      PWR_CR7_WUP12_Msk

