embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    IDR    ===================================================== */
#define GPIO_IDR_ID15_Pos                                                  (15UL)   /*!<GPIO IDR: ID15 (Bit 15) */
#define GPIO_IDR_ID15_Msk                                                  (0x8000UL)   /*!< GPIO IDR: ID15 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID15                                                      GPIO_IDR_ID15_Msk
#define GPIO_IDR_ID14_Pos                                                  (14UL)   /*!<GPIO IDR: ID14 (Bit 14) */
#define GPIO_IDR_ID14_Msk                                                  (0x4000UL)   /*!< GPIO IDR: ID14 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID14                                                      GPIO_IDR_ID14_Msk
#define GPIO_IDR_ID13_Pos                                                  (13UL)   /*!<GPIO IDR: ID13 (Bit 13) */
#define GPIO_IDR_ID13_Msk                                                  (0x2000UL)   /*!< GPIO IDR: ID13 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID13                                                      GPIO_IDR_ID13_Msk
#define GPIO_IDR_ID12_Pos                                                  (12UL)   /*!<GPIO IDR: ID12 (Bit 12) */
#define GPIO_IDR_ID12_Msk                                                  (0x1000UL)   /*!< GPIO IDR: ID12 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID12                                                      GPIO_IDR_ID12_Msk
#define GPIO_IDR_ID11_Pos                                                  (11UL)   /*!<GPIO IDR: ID11 (Bit 11) */
#define GPIO_IDR_ID11_Msk                                                  (0x800UL)    /*!< GPIO IDR: ID11 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID11                                                      GPIO_IDR_ID11_Msk
#define GPIO_IDR_ID10_Pos                                                  (10UL)   /*!<GPIO IDR: ID10 (Bit 10) */
#define GPIO_IDR_ID10_Msk                                                  (0x400UL)    /*!< GPIO IDR: ID10 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID10                                                      GPIO_IDR_ID10_Msk
#define GPIO_IDR_ID9_Pos                                                   (9UL)    /*!<GPIO IDR: ID9 (Bit 9) */
#define GPIO_IDR_ID9_Msk                                                   (0x200UL)    /*!< GPIO IDR: ID9 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID9                                                       GPIO_IDR_ID9_Msk
#define GPIO_IDR_ID8_Pos                                                   (8UL)    /*!<GPIO IDR: ID8 (Bit 8) */
#define GPIO_IDR_ID8_Msk                                                   (0x100UL)    /*!< GPIO IDR: ID8 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID8                                                       GPIO_IDR_ID8_Msk
#define GPIO_IDR_ID7_Pos                                                   (7UL)    /*!<GPIO IDR: ID7 (Bit 7) */
#define GPIO_IDR_ID7_Msk                                                   (0x80UL)   /*!< GPIO IDR: ID7 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID7                                                       GPIO_IDR_ID7_Msk
#define GPIO_IDR_ID6_Pos                                                   (6UL)    /*!<GPIO IDR: ID6 (Bit 6) */
#define GPIO_IDR_ID6_Msk                                                   (0x40UL)   /*!< GPIO IDR: ID6 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID6                                                       GPIO_IDR_ID6_Msk
#define GPIO_IDR_ID5_Pos                                                   (5UL)    /*!<GPIO IDR: ID5 (Bit 5) */
#define GPIO_IDR_ID5_Msk                                                   (0x20UL)   /*!< GPIO IDR: ID5 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID5                                                       GPIO_IDR_ID5_Msk
#define GPIO_IDR_ID4_Pos                                                   (4UL)    /*!<GPIO IDR: ID4 (Bit 4) */
#define GPIO_IDR_ID4_Msk                                                   (0x10UL)   /*!< GPIO IDR: ID4 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID4                                                       GPIO_IDR_ID4_Msk
#define GPIO_IDR_ID3_Pos                                                   (3UL)    /*!<GPIO IDR: ID3 (Bit 3) */
#define GPIO_IDR_ID3_Msk                                                   (0x8UL)    /*!< GPIO IDR: ID3 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID3                                                       GPIO_IDR_ID3_Msk
#define GPIO_IDR_ID2_Pos                                                   (2UL)    /*!<GPIO IDR: ID2 (Bit 2) */
#define GPIO_IDR_ID2_Msk                                                   (0x4UL)    /*!< GPIO IDR: ID2 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID2                                                       GPIO_IDR_ID2_Msk
#define GPIO_IDR_ID1_Pos                                                   (1UL)    /*!<GPIO IDR: ID1 (Bit 1) */
#define GPIO_IDR_ID1_Msk                                                   (0x2UL)    /*!< GPIO IDR: ID1 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID1                                                       GPIO_IDR_ID1_Msk
#define GPIO_IDR_ID0_Pos                                                   (0UL)    /*!<GPIO IDR: ID0 (Bit 0) */
#define GPIO_IDR_ID0_Msk                                                   (0x1UL)    /*!< GPIO IDR: ID0 (Bitfield-Mask: 0x01) */
#define GPIO_IDR_ID0                                                       GPIO_IDR_ID0_Msk

/* =====================================================    ODR    ===================================================== */
#define GPIO_ODR_OD15_Pos                                                  (15UL)   /*!<GPIO ODR: OD15 (Bit 15) */
#define GPIO_ODR_OD15_Msk                                                  (0x8000UL)   /*!< GPIO ODR: OD15 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD15                                                      GPIO_ODR_OD15_Msk
#define GPIO_ODR_OD14_Pos                                                  (14UL)   /*!<GPIO ODR: OD14 (Bit 14) */
#define GPIO_ODR_OD14_Msk                                                  (0x4000UL)   /*!< GPIO ODR: OD14 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD14                                                      GPIO_ODR_OD14_Msk
#define GPIO_ODR_OD13_Pos                                                  (13UL)   /*!<GPIO ODR: OD13 (Bit 13) */
#define GPIO_ODR_OD13_Msk                                                  (0x2000UL)   /*!< GPIO ODR: OD13 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD13                                                      GPIO_ODR_OD13_Msk
#define GPIO_ODR_OD12_Pos                                                  (12UL)   /*!<GPIO ODR: OD12 (Bit 12) */
#define GPIO_ODR_OD12_Msk                                                  (0x1000UL)   /*!< GPIO ODR: OD12 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD12                                                      GPIO_ODR_OD12_Msk
#define GPIO_ODR_OD11_Pos                                                  (11UL)   /*!<GPIO ODR: OD11 (Bit 11) */
#define GPIO_ODR_OD11_Msk                                                  (0x800UL)    /*!< GPIO ODR: OD11 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD11                                                      GPIO_ODR_OD11_Msk
#define GPIO_ODR_OD10_Pos                                                  (10UL)   /*!<GPIO ODR: OD10 (Bit 10) */
#define GPIO_ODR_OD10_Msk                                                  (0x400UL)    /*!< GPIO ODR: OD10 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD10                                                      GPIO_ODR_OD10_Msk
#define GPIO_ODR_OD9_Pos                                                   (9UL)    /*!<GPIO ODR: OD9 (Bit 9) */
#define GPIO_ODR_OD9_Msk                                                   (0x200UL)    /*!< GPIO ODR: OD9 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD9                                                       GPIO_ODR_OD9_Msk
#define GPIO_ODR_OD8_Pos                                                   (8UL)    /*!<GPIO ODR: OD8 (Bit 8) */
#define GPIO_ODR_OD8_Msk                                                   (0x100UL)    /*!< GPIO ODR: OD8 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD8                                                       GPIO_ODR_OD8_Msk
#define GPIO_ODR_OD7_Pos                                                   (7UL)    /*!<GPIO ODR: OD7 (Bit 7) */
#define GPIO_ODR_OD7_Msk                                                   (0x80UL)   /*!< GPIO ODR: OD7 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD7                                                       GPIO_ODR_OD7_Msk
#define GPIO_ODR_OD6_Pos                                                   (6UL)    /*!<GPIO ODR: OD6 (Bit 6) */
#define GPIO_ODR_OD6_Msk                                                   (0x40UL)   /*!< GPIO ODR: OD6 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD6                                                       GPIO_ODR_OD6_Msk
#define GPIO_ODR_OD5_Pos                                                   (5UL)    /*!<GPIO ODR: OD5 (Bit 5) */
#define GPIO_ODR_OD5_Msk                                                   (0x20UL)   /*!< GPIO ODR: OD5 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD5                                                       GPIO_ODR_OD5_Msk
#define GPIO_ODR_OD4_Pos                                                   (4UL)    /*!<GPIO ODR: OD4 (Bit 4) */
#define GPIO_ODR_OD4_Msk                                                   (0x10UL)   /*!< GPIO ODR: OD4 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD4                                                       GPIO_ODR_OD4_Msk
#define GPIO_ODR_OD3_Pos                                                   (3UL)    /*!<GPIO ODR: OD3 (Bit 3) */
#define GPIO_ODR_OD3_Msk                                                   (0x8UL)    /*!< GPIO ODR: OD3 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD3                                                       GPIO_ODR_OD3_Msk
#define GPIO_ODR_OD2_Pos                                                   (2UL)    /*!<GPIO ODR: OD2 (Bit 2) */
#define GPIO_ODR_OD2_Msk                                                   (0x4UL)    /*!< GPIO ODR: OD2 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD2                                                       GPIO_ODR_OD2_Msk
#define GPIO_ODR_OD1_Pos                                                   (1UL)    /*!<GPIO ODR: OD1 (Bit 1) */
#define GPIO_ODR_OD1_Msk                                                   (0x2UL)    /*!< GPIO ODR: OD1 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD1                                                       GPIO_ODR_OD1_Msk
#define GPIO_ODR_OD0_Pos                                                   (0UL)    /*!<GPIO ODR: OD0 (Bit 0) */
#define GPIO_ODR_OD0_Msk                                                   (0x1UL)    /*!< GPIO ODR: OD0 (Bitfield-Mask: 0x01) */
#define GPIO_ODR_OD0                                                       GPIO_ODR_OD0_Msk

