embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    MANAESKEY2REG    ===================================================== */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos                             (0UL)    /*!<BLUE MANAESKEY2REG: MANAESKEY_95_64 (Bit 0) */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_Msk                             (0xffffffffUL)   /*!< BLUE MANAESKEY2REG: MANAESKEY_95_64 (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64                                 BLUE_MANAESKEY2REG_MANAESKEY_95_64_Msk
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_0                               (0x1U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_1                               (0x2U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_2                               (0x4U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_3                               (0x8U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_4                               (0x10U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_5                               (0x20U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_6                               (0x40U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_7                               (0x80U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_8                               (0x100U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_9                               (0x200U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_10                              (0x400U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_11                              (0x800U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_12                              (0x1000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_13                              (0x2000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_14                              (0x4000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_15                              (0x8000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_16                              (0x10000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_17                              (0x20000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_18                              (0x40000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_19                              (0x80000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_20                              (0x100000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_21                              (0x200000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_22                              (0x400000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_23                              (0x800000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_24                              (0x1000000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_25                              (0x2000000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_26                              (0x4000000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_27                              (0x8000000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_28                              (0x10000000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_29                              (0x20000000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_30                              (0x40000000U << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_31                              (0x80000000UL << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)

/* =====================================================    MANAESKEY3REG    ===================================================== */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos                            (0UL)    /*!<BLUE MANAESKEY3REG: MANAESKEY_127_96 (Bit 0) */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_Msk                            (0xffffffffUL)   /*!< BLUE MANAESKEY3REG: MANAESKEY_127_96 (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96                                BLUE_MANAESKEY3REG_MANAESKEY_127_96_Msk
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_0                              (0x1U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_1                              (0x2U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_2                              (0x4U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_3                              (0x8U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_4                              (0x10U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_5                              (0x20U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_6                              (0x40U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_7                              (0x80U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_8                              (0x100U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_9                              (0x200U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_10                             (0x400U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_11                             (0x800U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_12                             (0x1000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_13                             (0x2000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_14                             (0x4000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_15                             (0x8000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_16                             (0x10000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_17                             (0x20000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_18                             (0x40000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_19                             (0x80000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_20                             (0x100000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_21                             (0x200000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_22                             (0x400000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_23                             (0x800000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_24                             (0x1000000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_25                             (0x2000000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_26                             (0x4000000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_27                             (0x8000000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_28                             (0x10000000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_29                             (0x20000000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_30                             (0x40000000U << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_31                             (0x80000000UL << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)

