embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    MANAESCLEARTEXT0REG    ===================================================== */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos                        (0UL)    /*!<BLUE MANAESCLEARTEXT0REG: AES_CLEAR_31_0 (Bit 0) */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Msk                        (0xffffffffUL)   /*!< BLUE MANAESCLEARTEXT0REG: AES_CLEAR_31_0 (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0                            BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Msk
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_0                          (0x1U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_1                          (0x2U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_2                          (0x4U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_3                          (0x8U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_4                          (0x10U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_5                          (0x20U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_6                          (0x40U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_7                          (0x80U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_8                          (0x100U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_9                          (0x200U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_10                         (0x400U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_11                         (0x800U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_12                         (0x1000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_13                         (0x2000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_14                         (0x4000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_15                         (0x8000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_16                         (0x10000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_17                         (0x20000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_18                         (0x40000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_19                         (0x80000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_20                         (0x100000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_21                         (0x200000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_22                         (0x400000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_23                         (0x800000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_24                         (0x1000000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_25                         (0x2000000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_26                         (0x4000000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_27                         (0x8000000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_28                         (0x10000000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_29                         (0x20000000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_30                         (0x40000000U << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_31                         (0x80000000UL << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)

/* =====================================================    MANAESCLEARTEXT1REG    ===================================================== */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos                       (0UL)    /*!<BLUE MANAESCLEARTEXT1REG: AES_CLEAR_63_32 (Bit 0) */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Msk                       (0xffffffffUL)   /*!< BLUE MANAESCLEARTEXT1REG: AES_CLEAR_63_32 (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32                           BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Msk
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_0                         (0x1U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_1                         (0x2U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_2                         (0x4U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_3                         (0x8U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_4                         (0x10U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_5                         (0x20U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_6                         (0x40U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_7                         (0x80U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_8                         (0x100U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_9                         (0x200U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_10                        (0x400U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_11                        (0x800U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_12                        (0x1000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_13                        (0x2000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_14                        (0x4000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_15                        (0x8000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_16                        (0x10000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_17                        (0x20000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_18                        (0x40000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_19                        (0x80000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_20                        (0x100000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_21                        (0x200000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_22                        (0x400000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_23                        (0x800000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_24                        (0x1000000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_25                        (0x2000000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_26                        (0x4000000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_27                        (0x8000000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_28                        (0x10000000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_29                        (0x20000000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_30                        (0x40000000U << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_31                        (0x80000000UL << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)

/* =====================================================    MANAESCLEARTEXT2REG    ===================================================== */
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos                       (0UL)    /*!<BLUE MANAESCLEARTEXT2REG: AES_CLEAR_95_64 (Bit 0) */
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Msk                       (0xffffffffUL)   /*!< BLUE MANAESCLEARTEXT2REG: AES_CLEAR_95_64 (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64                           BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Msk
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_0                         (0x1U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_1                         (0x2U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_2                         (0x4U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_3                         (0x8U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_4                         (0x10U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_5                         (0x20U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_6                         (0x40U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_7                         (0x80U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_8                         (0x100U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_9                         (0x200U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_10                        (0x400U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_11                        (0x800U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_12                        (0x1000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_13                        (0x2000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_14                        (0x4000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_15                        (0x8000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_16                        (0x10000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_17                        (0x20000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_18                        (0x40000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_19                        (0x80000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_20                        (0x100000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_21                        (0x200000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_22                        (0x400000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_23                        (0x800000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_24                        (0x1000000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_25                        (0x2000000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_26                        (0x4000000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_27                        (0x8000000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_28                        (0x10000000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_29                        (0x20000000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_30                        (0x40000000U << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)
#define BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_31                        (0x80000000UL << BLUE_MANAESCLEARTEXT2REG_AES_CLEAR_95_64_Pos)

/* =====================================================    MANAESCLEARTEXT3REG    ===================================================== */
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos                      (0UL)    /*!<BLUE MANAESCLEARTEXT3REG: AES_CLEAR_127_96 (Bit 0) */
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Msk                      (0xffffffffUL)   /*!< BLUE MANAESCLEARTEXT3REG: AES_CLEAR_127_96 (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96                          BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Msk
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_0                        (0x1U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_1                        (0x2U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_2                        (0x4U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_3                        (0x8U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_4                        (0x10U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_5                        (0x20U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_6                        (0x40U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_7                        (0x80U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_8                        (0x100U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_9                        (0x200U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_10                       (0x400U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_11                       (0x800U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_12                       (0x1000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_13                       (0x2000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_14                       (0x4000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_15                       (0x8000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_16                       (0x10000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_17                       (0x20000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_18                       (0x40000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_19                       (0x80000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_20                       (0x100000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_21                       (0x200000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_22                       (0x400000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_23                       (0x800000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_24                       (0x1000000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_25                       (0x2000000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_26                       (0x4000000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_27                       (0x8000000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_28                       (0x10000000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_29                       (0x20000000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_30                       (0x40000000U << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_31                       (0x80000000UL << BLUE_MANAESCLEARTEXT3REG_AES_CLEAR_127_96_Pos)

