embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    MANAESCIPHERTEXT0REG    ===================================================== */
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos                      (0UL)    /*!<BLUE MANAESCIPHERTEXT0REG: AES_CIPHER_31_0 (Bit 0) */
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Msk                      (0xffffffffUL)   /*!< BLUE MANAESCIPHERTEXT0REG: AES_CIPHER_31_0 (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0                          BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Msk
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_0                        (0x1U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_1                        (0x2U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_2                        (0x4U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_3                        (0x8U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_4                        (0x10U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_5                        (0x20U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_6                        (0x40U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_7                        (0x80U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_8                        (0x100U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_9                        (0x200U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_10                       (0x400U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_11                       (0x800U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_12                       (0x1000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_13                       (0x2000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_14                       (0x4000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_15                       (0x8000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_16                       (0x10000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_17                       (0x20000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_18                       (0x40000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_19                       (0x80000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_20                       (0x100000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_21                       (0x200000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_22                       (0x400000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_23                       (0x800000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_24                       (0x1000000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_25                       (0x2000000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_26                       (0x4000000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_27                       (0x8000000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_28                       (0x10000000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_29                       (0x20000000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_30                       (0x40000000U << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_31                       (0x80000000UL << BLUE_MANAESCIPHERTEXT0REG_AES_CIPHER_31_0_Pos)

/* =====================================================    MANAESCIPHERTEXT1REG    ===================================================== */
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos                     (0UL)    /*!<BLUE MANAESCIPHERTEXT1REG: AES_CIPHER_63_32 (Bit 0) */
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Msk                     (0xffffffffUL)   /*!< BLUE MANAESCIPHERTEXT1REG: AES_CIPHER_63_32 (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32                         BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Msk
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_0                       (0x1U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_1                       (0x2U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_2                       (0x4U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_3                       (0x8U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_4                       (0x10U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_5                       (0x20U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_6                       (0x40U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_7                       (0x80U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_8                       (0x100U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_9                       (0x200U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_10                      (0x400U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_11                      (0x800U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_12                      (0x1000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_13                      (0x2000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_14                      (0x4000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_15                      (0x8000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_16                      (0x10000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_17                      (0x20000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_18                      (0x40000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_19                      (0x80000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_20                      (0x100000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_21                      (0x200000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_22                      (0x400000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_23                      (0x800000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_24                      (0x1000000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_25                      (0x2000000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_26                      (0x4000000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_27                      (0x8000000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_28                      (0x10000000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_29                      (0x20000000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_30                      (0x40000000U << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_31                      (0x80000000UL << BLUE_MANAESCIPHERTEXT1REG_AES_CIPHER_63_32_Pos)

