embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    MANAESCIPHERTEXT2REG    ===================================================== */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos                     (0UL)    /*!<BLUE MANAESCIPHERTEXT2REG: AES_CIPHER_95_64 (Bit 0) */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Msk                     (0xffffffffUL)   /*!< BLUE MANAESCIPHERTEXT2REG: AES_CIPHER_95_64 (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64                         BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Msk
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_0                       (0x1U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_1                       (0x2U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_2                       (0x4U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_3                       (0x8U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_4                       (0x10U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_5                       (0x20U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_6                       (0x40U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_7                       (0x80U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_8                       (0x100U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_9                       (0x200U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_10                      (0x400U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_11                      (0x800U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_12                      (0x1000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_13                      (0x2000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_14                      (0x4000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_15                      (0x8000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_16                      (0x10000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_17                      (0x20000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_18                      (0x40000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_19                      (0x80000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_20                      (0x100000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_21                      (0x200000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_22                      (0x400000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_23                      (0x800000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_24                      (0x1000000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_25                      (0x2000000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_26                      (0x4000000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_27                      (0x8000000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_28                      (0x10000000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_29                      (0x20000000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_30                      (0x40000000U << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_31                      (0x80000000UL << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)

/* =====================================================    MANAESCIPHERTEXT3REG    ===================================================== */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos                    (0UL)    /*!<BLUE MANAESCIPHERTEXT3REG: AES_CIPHER_127_96 (Bit 0) */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Msk                    (0xffffffffUL)   /*!< BLUE MANAESCIPHERTEXT3REG: AES_CIPHER_127_96 (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96                        BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Msk
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_0                      (0x1U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_1                      (0x2U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_2                      (0x4U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_3                      (0x8U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_4                      (0x10U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_5                      (0x20U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_6                      (0x40U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_7                      (0x80U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_8                      (0x100U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_9                      (0x200U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_10                     (0x400U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_11                     (0x800U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_12                     (0x1000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_13                     (0x2000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_14                     (0x4000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_15                     (0x8000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_16                     (0x10000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_17                     (0x20000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_18                     (0x40000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_19                     (0x80000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_20                     (0x100000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_21                     (0x200000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_22                     (0x400000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_23                     (0x800000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_24                     (0x1000000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_25                     (0x2000000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_26                     (0x4000000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_27                     (0x8000000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_28                     (0x10000000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_29                     (0x20000000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_30                     (0x40000000U << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_31                     (0x80000000UL << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)

/* =====================================================    MANAESCMDREG    ===================================================== */
#define BLUE_MANAESCMDREG_INTENA_Pos                                       (1UL)    /*!<BLUE MANAESCMDREG: INTENA (Bit 1) */
#define BLUE_MANAESCMDREG_INTENA_Msk                                       (0x2UL)    /*!< BLUE MANAESCMDREG: INTENA (Bitfield-Mask: 0x01) */
#define BLUE_MANAESCMDREG_INTENA                                           BLUE_MANAESCMDREG_INTENA_Msk
#define BLUE_MANAESCMDREG_START_Pos                                        (0UL)    /*!<BLUE MANAESCMDREG: START (Bit 0) */
#define BLUE_MANAESCMDREG_START_Msk                                        (0x1UL)    /*!< BLUE MANAESCMDREG: START (Bitfield-Mask: 0x01) */
#define BLUE_MANAESCMDREG_START                                            BLUE_MANAESCMDREG_START_Msk

/* =====================================================    MANAESSTATREG    ===================================================== */
#define BLUE_MANAESSTATREG_BUSY_Pos                                        (0UL)    /*!<BLUE MANAESSTATREG: BUSY (Bit 0) */
#define BLUE_MANAESSTATREG_BUSY_Msk                                        (0x1UL)    /*!< BLUE MANAESSTATREG: BUSY (Bitfield-Mask: 0x01) */
#define BLUE_MANAESSTATREG_BUSY                                            BLUE_MANAESSTATREG_BUSY_Msk

/* =====================================================    AESLEPRIVPOINTERREG    ===================================================== */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_Pos                               (0UL)    /*!<BLUE AESLEPRIVPOINTERREG: POINTER (Bit 0) */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_Msk                               (0xffffffUL)   /*!< BLUE AESLEPRIVPOINTERREG: POINTER (Bitfield-Mask: 0xffffff) */
#define BLUE_AESLEPRIVPOINTERREG_POINTER                                   BLUE_AESLEPRIVPOINTERREG_POINTER_Msk
#define BLUE_AESLEPRIVPOINTERREG_POINTER_0                                 (0x1U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_1                                 (0x2U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_2                                 (0x4U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_3                                 (0x8U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_4                                 (0x10U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_5                                 (0x20U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_6                                 (0x40U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_7                                 (0x80U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_8                                 (0x100U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_9                                 (0x200U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_10                                (0x400U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_11                                (0x800U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_12                                (0x1000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_13                                (0x2000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_14                                (0x4000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_15                                (0x8000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_16                                (0x10000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_17                                (0x20000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_18                                (0x40000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_19                                (0x80000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_20                                (0x100000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_21                                (0x200000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_22                                (0x400000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_23                                (0x800000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)

/* =====================================================    AESLEPRIVHASHREG    ===================================================== */
#define BLUE_AESLEPRIVHASHREG_HASH_Pos                                     (0UL)    /*!<BLUE AESLEPRIVHASHREG: HASH (Bit 0) */
#define BLUE_AESLEPRIVHASHREG_HASH_Msk                                     (0xffffffUL)   /*!< BLUE AESLEPRIVHASHREG: HASH (Bitfield-Mask: 0xffffff) */
#define BLUE_AESLEPRIVHASHREG_HASH                                         BLUE_AESLEPRIVHASHREG_HASH_Msk
#define BLUE_AESLEPRIVHASHREG_HASH_0                                       (0x1U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_1                                       (0x2U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_2                                       (0x4U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_3                                       (0x8U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_4                                       (0x10U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_5                                       (0x20U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_6                                       (0x40U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_7                                       (0x80U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_8                                       (0x100U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_9                                       (0x200U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_10                                      (0x400U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_11                                      (0x800U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_12                                      (0x1000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_13                                      (0x2000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_14                                      (0x4000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_15                                      (0x8000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_16                                      (0x10000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_17                                      (0x20000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_18                                      (0x40000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_19                                      (0x80000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_20                                      (0x100000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_21                                      (0x200000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_22                                      (0x400000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_23                                      (0x800000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)

