embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    DEBUGCMDREG    ===================================================== */
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos                                  (16UL)   /*!<BLUE DEBUGCMDREG: AESDEBUGMODE (Bit 16) */
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_Msk                                  (0xf0000UL)    /*!< BLUE DEBUGCMDREG: AESDEBUGMODE (Bitfield-Mask: 0x0f) */
#define BLUE_DEBUGCMDREG_AESDEBUGMODE                                      BLUE_DEBUGCMDREG_AESDEBUGMODE_Msk
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_0                                    (0x1U << BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos)
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_1                                    (0x2U << BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos)
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_2                                    (0x4U << BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos)
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_3                                    (0x8U << BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos)
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos                                (2UL)    /*!<BLUE DEBUGCMDREG: SEQDEBUGBUSSEL (Bit 2) */
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Msk                                (0x3cUL)   /*!< BLUE DEBUGCMDREG: SEQDEBUGBUSSEL (Bitfield-Mask: 0x0f) */
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL                                    BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Msk
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_0                                  (0x1U << BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos)
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_1                                  (0x2U << BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos)
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_2                                  (0x4U << BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos)
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_3                                  (0x8U << BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos)
#define BLUE_DEBUGCMDREG_SEQDEBUGMODE_Pos                                  (1UL)    /*!<BLUE DEBUGCMDREG: SEQDEBUGMODE (Bit 1) */
#define BLUE_DEBUGCMDREG_SEQDEBUGMODE_Msk                                  (0x2UL)    /*!< BLUE DEBUGCMDREG: SEQDEBUGMODE (Bitfield-Mask: 0x01) */
#define BLUE_DEBUGCMDREG_SEQDEBUGMODE                                      BLUE_DEBUGCMDREG_SEQDEBUGMODE_Msk
#define BLUE_DEBUGCMDREG_CLEARDEBUGINT_Pos                                 (0UL)    /*!<BLUE DEBUGCMDREG: CLEARDEBUGINT (Bit 0) */
#define BLUE_DEBUGCMDREG_CLEARDEBUGINT_Msk                                 (0x1UL)    /*!< BLUE DEBUGCMDREG: CLEARDEBUGINT (Bitfield-Mask: 0x01) */
#define BLUE_DEBUGCMDREG_CLEARDEBUGINT                                     BLUE_DEBUGCMDREG_CLEARDEBUGINT_Msk

/* =====================================================    DEBUGSTATUSREG    ===================================================== */
#define BLUE_DEBUGSTATUSREG_AESDBG_3_Pos                                   (19UL)   /*!<BLUE DEBUGSTATUSREG: AESDBG_3 (Bit 19) */
#define BLUE_DEBUGSTATUSREG_AESDBG_3_Msk                                   (0x80000UL)    /*!< BLUE DEBUGSTATUSREG: AESDBG_3 (Bitfield-Mask: 0x01) */
#define BLUE_DEBUGSTATUSREG_AESDBG_3                                       BLUE_DEBUGSTATUSREG_AESDBG_3_Msk
#define BLUE_DEBUGSTATUSREG_AESDBG_2_Pos                                   (18UL)   /*!<BLUE DEBUGSTATUSREG: AESDBG_2 (Bit 18) */
#define BLUE_DEBUGSTATUSREG_AESDBG_2_Msk                                   (0x40000UL)    /*!< BLUE DEBUGSTATUSREG: AESDBG_2 (Bitfield-Mask: 0x01) */
#define BLUE_DEBUGSTATUSREG_AESDBG_2                                       BLUE_DEBUGSTATUSREG_AESDBG_2_Msk
#define BLUE_DEBUGSTATUSREG_AESDBG_1_Pos                                   (17UL)   /*!<BLUE DEBUGSTATUSREG: AESDBG_1 (Bit 17) */
#define BLUE_DEBUGSTATUSREG_AESDBG_1_Msk                                   (0x20000UL)    /*!< BLUE DEBUGSTATUSREG: AESDBG_1 (Bitfield-Mask: 0x01) */
#define BLUE_DEBUGSTATUSREG_AESDBG_1                                       BLUE_DEBUGSTATUSREG_AESDBG_1_Msk
#define BLUE_DEBUGSTATUSREG_AESDBG_0_Pos                                   (16UL)   /*!<BLUE DEBUGSTATUSREG: AESDBG_0 (Bit 16) */
#define BLUE_DEBUGSTATUSREG_AESDBG_0_Msk                                   (0x10000UL)    /*!< BLUE DEBUGSTATUSREG: AESDBG_0 (Bitfield-Mask: 0x01) */
#define BLUE_DEBUGSTATUSREG_AESDBG_0                                       BLUE_DEBUGSTATUSREG_AESDBG_0_Msk
#define BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_Pos                             (0UL)    /*!<BLUE DEBUGSTATUSREG: DEBUGSTATUSREG (Bit 0) */
#define BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_Msk                             (0x3fUL)   /*!< BLUE DEBUGSTATUSREG: DEBUGSTATUSREG (Bitfield-Mask: 0x3f) */
#define BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG                                 BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_Msk
#define BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_0                               (0x1U << BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_Pos)
#define BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_1                               (0x2U << BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_Pos)
#define BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_2                               (0x4U << BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_Pos)
#define BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_3                               (0x8U << BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_Pos)
#define BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_4                               (0x10U << BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_Pos)
#define BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_5                               (0x20U << BLUE_DEBUGSTATUSREG_DEBUGSTATUSREG_Pos)

/* =====================================================    STATUS2REG    ===================================================== */
#define BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR_Pos        (31UL)   /*!<BLUE STATUS2REG: ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR (Bit 31) */
#define BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR_Msk        (0x80000000UL)   /*!< BLUE STATUS2REG: ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR            BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR_Msk
#define BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR_Pos         (30UL)   /*!<BLUE STATUS2REG: ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR (Bit 30) */
#define BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR_Msk         (0x40000000UL)   /*!< BLUE STATUS2REG: ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR             BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR_Msk
#define BLUE_STATUS2REG_IQSAMPLES_MISSING_ERROR_Pos                        (29UL)   /*!<BLUE STATUS2REG: IQSAMPLES_MISSING_ERROR (Bit 29) */
#define BLUE_STATUS2REG_IQSAMPLES_MISSING_ERROR_Msk                        (0x20000000UL)   /*!< BLUE STATUS2REG: IQSAMPLES_MISSING_ERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUS2REG_IQSAMPLES_MISSING_ERROR                            BLUE_STATUS2REG_IQSAMPLES_MISSING_ERROR_Msk
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos                               (1UL)    /*!<BLUE STATUS2REG: IQSAMPLES_NUMBER (Bit 1) */
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_Msk                               (0xfeUL)   /*!< BLUE STATUS2REG: IQSAMPLES_NUMBER (Bitfield-Mask: 0x7f) */
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER                                   BLUE_STATUS2REG_IQSAMPLES_NUMBER_Msk
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_0                                 (0x1U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_1                                 (0x2U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_2                                 (0x4U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_3                                 (0x8U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_4                                 (0x10U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_5                                 (0x20U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_6                                 (0x40U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_READY_Pos                                (0UL)    /*!<BLUE STATUS2REG: IQSAMPLES_READY (Bit 0) */
#define BLUE_STATUS2REG_IQSAMPLES_READY_Msk                                (0x1UL)    /*!< BLUE STATUS2REG: IQSAMPLES_READY (Bitfield-Mask: 0x01) */
#define BLUE_STATUS2REG_IQSAMPLES_READY                                    BLUE_STATUS2REG_IQSAMPLES_READY_Msk


/* =========================================================================================================================== */
/*=====================                                      WAKEUP                                      ===================== */
/* =========================================================================================================================== */

/* =====================================================    WAKEUP_BLOCK_VERSION    ===================================================== */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos                     (8UL)    /*!<WAKEUP WAKEUP_BLOCK_VERSION: VERSION_NUMBER (Bit 8) */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Msk                     (0xff00UL)   /*!< WAKEUP WAKEUP_BLOCK_VERSION: VERSION_NUMBER (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER                         WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Msk
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_0                       (0x1U << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_1                       (0x2U << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_2                       (0x4U << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_3                       (0x8U << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_4                       (0x10U << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_5                       (0x20U << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_6                       (0x40U << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_7                       (0x80U << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos                        (0UL)    /*!<WAKEUP WAKEUP_BLOCK_VERSION: SUB_VERSION (Bit 0) */
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Msk                        (0xffUL)   /*!< WAKEUP WAKEUP_BLOCK_VERSION: SUB_VERSION (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION                            WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Msk
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_0                          (0x1U << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_1                          (0x2U << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_2                          (0x4U << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_3                          (0x8U << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_4                          (0x10U << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_5                          (0x20U << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_6                          (0x40U << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_7                          (0x80U << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)

/* =====================================================    WAKEUP_OFFSET_1    ===================================================== */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos                                   (24UL)   /*!<WAKEUP WAKEUP_OFFSET_1: MODE3 (Bit 24) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_Msk                                   (0xff000000UL)   /*!< WAKEUP WAKEUP_OFFSET_1: MODE3 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3                                       WAKEUP_WAKEUP_OFFSET_1_MODE3_Msk
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_0                                     (0x1U << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_1                                     (0x2U << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_2                                     (0x4U << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_3                                     (0x8U << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_4                                     (0x10U << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_5                                     (0x20U << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_6                                     (0x40U << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_7                                     (0x80U << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos                                   (16UL)   /*!<WAKEUP WAKEUP_OFFSET_1: MODE2 (Bit 16) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_Msk                                   (0xff0000UL)   /*!< WAKEUP WAKEUP_OFFSET_1: MODE2 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE2                                       WAKEUP_WAKEUP_OFFSET_1_MODE2_Msk
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_0                                     (0x1U << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_1                                     (0x2U << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_2                                     (0x4U << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_3                                     (0x8U << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_4                                     (0x10U << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_5                                     (0x20U << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_6                                     (0x40U << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_7                                     (0x80U << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos                                   (8UL)    /*!<WAKEUP WAKEUP_OFFSET_1: MODE1 (Bit 8) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_Msk                                   (0xff00UL)   /*!< WAKEUP WAKEUP_OFFSET_1: MODE1 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE1                                       WAKEUP_WAKEUP_OFFSET_1_MODE1_Msk
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_0                                     (0x1U << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_1                                     (0x2U << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_2                                     (0x4U << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_3                                     (0x8U << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_4                                     (0x10U << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_5                                     (0x20U << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_6                                     (0x40U << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_7                                     (0x80U << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos                                   (0UL)    /*!<WAKEUP WAKEUP_OFFSET_1: MODE0 (Bit 0) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_Msk                                   (0xffUL)   /*!< WAKEUP WAKEUP_OFFSET_1: MODE0 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE0                                       WAKEUP_WAKEUP_OFFSET_1_MODE0_Msk
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_0                                     (0x1U << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_1                                     (0x2U << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_2                                     (0x4U << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_3                                     (0x8U << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_4                                     (0x10U << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_5                                     (0x20U << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_6                                     (0x40U << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_7                                     (0x80U << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)

