embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    MINIMUM_PERIOD_LENGTH    ===================================================== */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos                            (4UL)    /*!<WAKEUP MINIMUM_PERIOD_LENGTH: LENGTH (Bit 4) */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Msk                            (0x3ff0UL)   /*!< WAKEUP MINIMUM_PERIOD_LENGTH: LENGTH (Bitfield-Mask: 0x3ff) */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH                                WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Msk
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_0                              (0x1U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_1                              (0x2U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_2                              (0x4U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_3                              (0x8U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_4                              (0x10U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_5                              (0x20U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_6                              (0x40U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_7                              (0x80U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_8                              (0x100U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_9                              (0x200U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_RESERVED3_0_Pos                       (0UL)    /*!<WAKEUP MINIMUM_PERIOD_LENGTH: RESERVED3_0 (Bit 0) */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_RESERVED3_0_Msk                       (0xfUL)    /*!< WAKEUP MINIMUM_PERIOD_LENGTH: RESERVED3_0 (Bitfield-Mask: 0x0f) */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_RESERVED3_0                           WAKEUP_MINIMUM_PERIOD_LENGTH_RESERVED3_0_Msk
#define WAKEUP_MINIMUM_PERIOD_LENGTH_RESERVED3_0_0                         (0x1U << WAKEUP_MINIMUM_PERIOD_LENGTH_RESERVED3_0_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_RESERVED3_0_1                         (0x2U << WAKEUP_MINIMUM_PERIOD_LENGTH_RESERVED3_0_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_RESERVED3_0_2                         (0x4U << WAKEUP_MINIMUM_PERIOD_LENGTH_RESERVED3_0_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_RESERVED3_0_3                         (0x8U << WAKEUP_MINIMUM_PERIOD_LENGTH_RESERVED3_0_Pos)

/* =====================================================    AVERAGE_PERIOD_LENGTH    ===================================================== */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos                     (24UL)   /*!<WAKEUP AVERAGE_PERIOD_LENGTH: AVERAGE_COUNT (Bit 24) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Msk                     (0xff000000UL)   /*!< WAKEUP AVERAGE_PERIOD_LENGTH: AVERAGE_COUNT (Bitfield-Mask: 0xff) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT                         WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Msk
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_0                       (0x1U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_1                       (0x2U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_2                       (0x4U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_3                       (0x8U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_4                       (0x10U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_5                       (0x20U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_6                       (0x40U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_7                       (0x80U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos                        (4UL)    /*!<WAKEUP AVERAGE_PERIOD_LENGTH: LENGTH_INT (Bit 4) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Msk                        (0x3ff0UL)   /*!< WAKEUP AVERAGE_PERIOD_LENGTH: LENGTH_INT (Bitfield-Mask: 0x3ff) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT                            WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Msk
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_0                          (0x1U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_1                          (0x2U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_2                          (0x4U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_3                          (0x8U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_4                          (0x10U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_5                          (0x20U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_6                          (0x40U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_7                          (0x80U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_8                          (0x100U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_9                          (0x200U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRAC_Pos                       (0UL)    /*!<WAKEUP AVERAGE_PERIOD_LENGTH: LENGTH_FRAC (Bit 0) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRAC_Msk                       (0xfUL)    /*!< WAKEUP AVERAGE_PERIOD_LENGTH: LENGTH_FRAC (Bitfield-Mask: 0x0f) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRAC                           WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRAC_Msk
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRAC_0                         (0x1U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRAC_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRAC_1                         (0x2U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRAC_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRAC_2                         (0x4U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRAC_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRAC_3                         (0x8U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRAC_Pos)

/* =====================================================    MAXIMUM_PERIOD_LENGTH    ===================================================== */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos                            (4UL)    /*!<WAKEUP MAXIMUM_PERIOD_LENGTH: LENGTH (Bit 4) */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Msk                            (0x3ff0UL)   /*!< WAKEUP MAXIMUM_PERIOD_LENGTH: LENGTH (Bitfield-Mask: 0x3ff) */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH                                WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Msk
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_0                              (0x1U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_1                              (0x2U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_2                              (0x4U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_3                              (0x8U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_4                              (0x10U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_5                              (0x20U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_6                              (0x40U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_7                              (0x80U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_8                              (0x100U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_9                              (0x200U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_RESERVED3_0_Pos                       (0UL)    /*!<WAKEUP MAXIMUM_PERIOD_LENGTH: RESERVED3_0 (Bit 0) */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_RESERVED3_0_Msk                       (0xfUL)    /*!< WAKEUP MAXIMUM_PERIOD_LENGTH: RESERVED3_0 (Bitfield-Mask: 0x0f) */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_RESERVED3_0                           WAKEUP_MAXIMUM_PERIOD_LENGTH_RESERVED3_0_Msk
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_RESERVED3_0_0                         (0x1U << WAKEUP_MAXIMUM_PERIOD_LENGTH_RESERVED3_0_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_RESERVED3_0_1                         (0x2U << WAKEUP_MAXIMUM_PERIOD_LENGTH_RESERVED3_0_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_RESERVED3_0_2                         (0x4U << WAKEUP_MAXIMUM_PERIOD_LENGTH_RESERVED3_0_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_RESERVED3_0_3                         (0x8U << WAKEUP_MAXIMUM_PERIOD_LENGTH_RESERVED3_0_Pos)

/* =====================================================    STATISTICS_RESTART    ===================================================== */
#define WAKEUP_STATISTICS_RESTART_CLR_AVR_Pos                              (1UL)    /*!<WAKEUP STATISTICS_RESTART: CLR_AVR (Bit 1) */
#define WAKEUP_STATISTICS_RESTART_CLR_AVR_Msk                              (0x2UL)    /*!< WAKEUP STATISTICS_RESTART: CLR_AVR (Bitfield-Mask: 0x01) */
#define WAKEUP_STATISTICS_RESTART_CLR_AVR                                  WAKEUP_STATISTICS_RESTART_CLR_AVR_Msk
#define WAKEUP_STATISTICS_RESTART_CLR_MIN_MAX_Pos                          (0UL)    /*!<WAKEUP STATISTICS_RESTART: CLR_MIN_MAX (Bit 0) */
#define WAKEUP_STATISTICS_RESTART_CLR_MIN_MAX_Msk                          (0x1UL)    /*!< WAKEUP STATISTICS_RESTART: CLR_MIN_MAX (Bitfield-Mask: 0x01) */
#define WAKEUP_STATISTICS_RESTART_CLR_MIN_MAX                              WAKEUP_STATISTICS_RESTART_CLR_MIN_MAX_Msk

/* =====================================================    BLUE_WAKEUP_TIME    ===================================================== */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos                            (0UL)    /*!<WAKEUP BLUE_WAKEUP_TIME: WAKEUP_TIME (Bit 0) */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Msk                            (0xffffffffUL)   /*!< WAKEUP BLUE_WAKEUP_TIME: WAKEUP_TIME (Bitfield-Mask: 0xffffffff) */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME                                WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Msk
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_0                              (0x1U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_1                              (0x2U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_2                              (0x4U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_3                              (0x8U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_4                              (0x10U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_5                              (0x20U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_6                              (0x40U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_7                              (0x80U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_8                              (0x100U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_9                              (0x200U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_10                             (0x400U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_11                             (0x800U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_12                             (0x1000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_13                             (0x2000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_14                             (0x4000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_15                             (0x8000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_16                             (0x10000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_17                             (0x20000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_18                             (0x40000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_19                             (0x80000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_20                             (0x100000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_21                             (0x200000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_22                             (0x400000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_23                             (0x800000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_24                             (0x1000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_25                             (0x2000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_26                             (0x4000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_27                             (0x8000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_28                             (0x10000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_29                             (0x20000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_30                             (0x40000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_31                             (0x80000000UL << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)

/* =====================================================    BLUE_SLEEP_REQUEST_MODE    ===================================================== */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Pos                  (31UL)   /*!<WAKEUP BLUE_SLEEP_REQUEST_MODE: FORCE_SLEEPING (Bit 31) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Msk                  (0x80000000UL)   /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: FORCE_SLEEPING (Bitfield-Mask: 0x01) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_FORCE_SLEEPING                      WAKEUP_BLUE_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Msk
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_BLE_WAKEUP_EN_Pos                   (30UL)   /*!<WAKEUP BLUE_SLEEP_REQUEST_MODE: BLE_WAKEUP_EN (Bit 30) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_BLE_WAKEUP_EN_Msk                   (0x40000000UL)   /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: BLE_WAKEUP_EN (Bitfield-Mask: 0x01) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_BLE_WAKEUP_EN                       WAKEUP_BLUE_SLEEP_REQUEST_MODE_BLE_WAKEUP_EN_Msk
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_EN_Pos                        (29UL)   /*!<WAKEUP BLUE_SLEEP_REQUEST_MODE: SLEEP_EN (Bit 29) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_EN_Msk                        (0x20000000UL)   /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: SLEEP_EN (Bitfield-Mask: 0x01) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_EN                            WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_EN_Msk
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos                  (0UL)    /*!<WAKEUP BLUE_SLEEP_REQUEST_MODE: SLEEP_REQ_MODE (Bit 0) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Msk                  (0x7UL)    /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: SLEEP_REQ_MODE (Bitfield-Mask: 0x07) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE                      WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Msk
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_0                    (0x1U << WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos)
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_1                    (0x2U << WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos)
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_2                    (0x4U << WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos)

/* =====================================================    CM0_WAKEUP_TIME    ===================================================== */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos                             (4UL)    /*!<WAKEUP CM0_WAKEUP_TIME: WAKEUP_TIME (Bit 4) */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Msk                             (0xfffffff0UL)   /*!< WAKEUP CM0_WAKEUP_TIME: WAKEUP_TIME (Bitfield-Mask: 0xfffffff) */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME                                 WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Msk
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_0                               (0x1U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_1                               (0x2U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_2                               (0x4U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_3                               (0x8U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_4                               (0x10U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_5                               (0x20U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_6                               (0x40U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_7                               (0x80U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_8                               (0x100U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_9                               (0x200U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_10                              (0x400U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_11                              (0x800U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_12                              (0x1000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_13                              (0x2000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_14                              (0x4000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_15                              (0x8000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_16                              (0x10000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_17                              (0x20000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_18                              (0x40000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_19                              (0x80000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_20                              (0x100000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_21                              (0x200000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_22                              (0x400000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_23                              (0x800000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_24                              (0x1000000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_25                              (0x2000000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_26                              (0x4000000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_27                              (0x8000000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)

/* =====================================================    CM0_SLEEP_REQUEST_MODE    ===================================================== */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Pos                   (31UL)   /*!<WAKEUP CM0_SLEEP_REQUEST_MODE: FORCE_SLEEPING (Bit 31) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Msk                   (0x80000000UL)   /*!< WAKEUP CM0_SLEEP_REQUEST_MODE: FORCE_SLEEPING (Bitfield-Mask: 0x01) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_FORCE_SLEEPING                       WAKEUP_CM0_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Msk
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_CPU_WAKEUP_EN_Pos                    (30UL)   /*!<WAKEUP CM0_SLEEP_REQUEST_MODE: CPU_WAKEUP_EN (Bit 30) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_CPU_WAKEUP_EN_Msk                    (0x40000000UL)   /*!< WAKEUP CM0_SLEEP_REQUEST_MODE: CPU_WAKEUP_EN (Bitfield-Mask: 0x01) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_CPU_WAKEUP_EN                        WAKEUP_CM0_SLEEP_REQUEST_MODE_CPU_WAKEUP_EN_Msk
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos                   (0UL)    /*!<WAKEUP CM0_SLEEP_REQUEST_MODE: SLEEP_REQ_MODE (Bit 0) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Msk                   (0x7UL)    /*!< WAKEUP CM0_SLEEP_REQUEST_MODE: SLEEP_REQ_MODE (Bitfield-Mask: 0x07) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE                       WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Msk
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_0                     (0x1U << WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos)
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_1                     (0x2U << WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos)
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_2                     (0x4U << WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos)

