embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    UDRA_RADIO_CFG_PTR    ===================================================== */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos                    (0UL)    /*!<RRM UDRA_RADIO_CFG_PTR: RADIO_CONFIG_ADDRESS (Bit 0) */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Msk                    (0xffffffffUL)   /*!< RRM UDRA_RADIO_CFG_PTR: RADIO_CONFIG_ADDRESS (Bitfield-Mask: 0xffffffff) */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS                        RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Msk
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_0                      (0x1U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_1                      (0x2U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_2                      (0x4U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_3                      (0x8U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_4                      (0x10U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_5                      (0x20U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_6                      (0x40U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_7                      (0x80U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_8                      (0x100U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_9                      (0x200U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_10                     (0x400U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_11                     (0x800U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_12                     (0x1000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_13                     (0x2000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_14                     (0x4000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_15                     (0x8000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_16                     (0x10000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_17                     (0x20000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_18                     (0x40000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_19                     (0x80000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_20                     (0x100000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_21                     (0x200000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_22                     (0x400000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_23                     (0x800000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_24                     (0x1000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_25                     (0x2000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_26                     (0x4000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_27                     (0x8000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_28                     (0x10000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_29                     (0x20000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_30                     (0x40000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_31                     (0x80000000UL << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)

/* =====================================================    SEMA_IRQ_ENABLE    ===================================================== */
#define RRM_SEMA_IRQ_ENABLE_UNLOCK_Pos                                     (1UL)    /*!<RRM SEMA_IRQ_ENABLE: UNLOCK (Bit 1) */
#define RRM_SEMA_IRQ_ENABLE_UNLOCK_Msk                                     (0x2UL)    /*!< RRM SEMA_IRQ_ENABLE: UNLOCK (Bitfield-Mask: 0x01) */
#define RRM_SEMA_IRQ_ENABLE_UNLOCK                                         RRM_SEMA_IRQ_ENABLE_UNLOCK_Msk
#define RRM_SEMA_IRQ_ENABLE_LOCK_Pos                                       (0UL)    /*!<RRM SEMA_IRQ_ENABLE: LOCK (Bit 0) */
#define RRM_SEMA_IRQ_ENABLE_LOCK_Msk                                       (0x1UL)    /*!< RRM SEMA_IRQ_ENABLE: LOCK (Bitfield-Mask: 0x01) */
#define RRM_SEMA_IRQ_ENABLE_LOCK                                           RRM_SEMA_IRQ_ENABLE_LOCK_Msk

/* =====================================================    SEMA_IRQ_STATUS    ===================================================== */
#define RRM_SEMA_IRQ_STATUS_UNLOCK_Pos                                     (1UL)    /*!<RRM SEMA_IRQ_STATUS: UNLOCK (Bit 1) */
#define RRM_SEMA_IRQ_STATUS_UNLOCK_Msk                                     (0x2UL)    /*!< RRM SEMA_IRQ_STATUS: UNLOCK (Bitfield-Mask: 0x01) */
#define RRM_SEMA_IRQ_STATUS_UNLOCK                                         RRM_SEMA_IRQ_STATUS_UNLOCK_Msk
#define RRM_SEMA_IRQ_STATUS_LOCK_Pos                                       (0UL)    /*!<RRM SEMA_IRQ_STATUS: LOCK (Bit 0) */
#define RRM_SEMA_IRQ_STATUS_LOCK_Msk                                       (0x1UL)    /*!< RRM SEMA_IRQ_STATUS: LOCK (Bitfield-Mask: 0x01) */
#define RRM_SEMA_IRQ_STATUS_LOCK                                           RRM_SEMA_IRQ_STATUS_LOCK_Msk

/* =====================================================    BLE_IRQ_ENABLE    ===================================================== */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_END_Pos                                (4UL)    /*!<RRM BLE_IRQ_ENABLE: PORT_CMD_END (Bit 4) */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_END_Msk                                (0x10UL)   /*!< RRM BLE_IRQ_ENABLE: PORT_CMD_END (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_END                                    RRM_BLE_IRQ_ENABLE_PORT_CMD_END_Msk
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_START_Pos                              (3UL)    /*!<RRM BLE_IRQ_ENABLE: PORT_CMD_START (Bit 3) */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_START_Msk                              (0x8UL)    /*!< RRM BLE_IRQ_ENABLE: PORT_CMD_START (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_START                                  RRM_BLE_IRQ_ENABLE_PORT_CMD_START_Msk
#define RRM_BLE_IRQ_ENABLE_PORT_PREEMPT_Pos                                (2UL)    /*!<RRM BLE_IRQ_ENABLE: PORT_PREEMPT (Bit 2) */
#define RRM_BLE_IRQ_ENABLE_PORT_PREEMPT_Msk                                (0x4UL)    /*!< RRM BLE_IRQ_ENABLE: PORT_PREEMPT (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_ENABLE_PORT_PREEMPT                                    RRM_BLE_IRQ_ENABLE_PORT_PREEMPT_Msk
#define RRM_BLE_IRQ_ENABLE_PORT_RELEASE_Pos                                (1UL)    /*!<RRM BLE_IRQ_ENABLE: PORT_RELEASE (Bit 1) */
#define RRM_BLE_IRQ_ENABLE_PORT_RELEASE_Msk                                (0x2UL)    /*!< RRM BLE_IRQ_ENABLE: PORT_RELEASE (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_ENABLE_PORT_RELEASE                                    RRM_BLE_IRQ_ENABLE_PORT_RELEASE_Msk
#define RRM_BLE_IRQ_ENABLE_PORT_GRANT_Pos                                  (0UL)    /*!<RRM BLE_IRQ_ENABLE: PORT_GRANT (Bit 0) */
#define RRM_BLE_IRQ_ENABLE_PORT_GRANT_Msk                                  (0x1UL)    /*!< RRM BLE_IRQ_ENABLE: PORT_GRANT (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_ENABLE_PORT_GRANT                                      RRM_BLE_IRQ_ENABLE_PORT_GRANT_Msk

