embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    DEM_MOD_DIG_USR    ===================================================== */
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos                                (1UL)    /*!<RRM DEM_MOD_DIG_USR: CHANNEL_NUM (Bit 1) */
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Msk                                (0xfeUL)   /*!< RRM DEM_MOD_DIG_USR: CHANNEL_NUM (Bitfield-Mask: 0x7f) */
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM                                    RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Msk
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_0                                  (0x1U << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_1                                  (0x2U << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_2                                  (0x4U << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_3                                  (0x8U << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_4                                  (0x10U << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_5                                  (0x20U << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_6                                  (0x40U << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)

/* =====================================================    RADIO_FSM_USR    ===================================================== */
#define RRM_RADIO_FSM_USR_PA_POWER_Pos                                     (3UL)    /*!<RRM RADIO_FSM_USR: PA_POWER (Bit 3) */
#define RRM_RADIO_FSM_USR_PA_POWER_Msk                                     (0xf8UL)   /*!< RRM RADIO_FSM_USR: PA_POWER (Bitfield-Mask: 0x1f) */
#define RRM_RADIO_FSM_USR_PA_POWER                                         RRM_RADIO_FSM_USR_PA_POWER_Msk
#define RRM_RADIO_FSM_USR_PA_POWER_0                                       (0x1U << RRM_RADIO_FSM_USR_PA_POWER_Pos)
#define RRM_RADIO_FSM_USR_PA_POWER_1                                       (0x2U << RRM_RADIO_FSM_USR_PA_POWER_Pos)
#define RRM_RADIO_FSM_USR_PA_POWER_2                                       (0x4U << RRM_RADIO_FSM_USR_PA_POWER_Pos)
#define RRM_RADIO_FSM_USR_PA_POWER_3                                       (0x8U << RRM_RADIO_FSM_USR_PA_POWER_Pos)
#define RRM_RADIO_FSM_USR_PA_POWER_4                                       (0x10U << RRM_RADIO_FSM_USR_PA_POWER_Pos)
#define RRM_RADIO_FSM_USR_EN_CALIB_SYNTH_Pos                               (2UL)    /*!<RRM RADIO_FSM_USR: EN_CALIB_SYNTH (Bit 2) */
#define RRM_RADIO_FSM_USR_EN_CALIB_SYNTH_Msk                               (0x4UL)    /*!< RRM RADIO_FSM_USR: EN_CALIB_SYNTH (Bitfield-Mask: 0x01) */
#define RRM_RADIO_FSM_USR_EN_CALIB_SYNTH                                   RRM_RADIO_FSM_USR_EN_CALIB_SYNTH_Msk
#define RRM_RADIO_FSM_USR_EN_CALIB_CBP_Pos                                 (1UL)    /*!<RRM RADIO_FSM_USR: EN_CALIB_CBP (Bit 1) */
#define RRM_RADIO_FSM_USR_EN_CALIB_CBP_Msk                                 (0x2UL)    /*!< RRM RADIO_FSM_USR: EN_CALIB_CBP (Bitfield-Mask: 0x01) */
#define RRM_RADIO_FSM_USR_EN_CALIB_CBP                                     RRM_RADIO_FSM_USR_EN_CALIB_CBP_Msk
#define RRM_RADIO_FSM_USR_TXMODE_Pos                                       (0UL)    /*!<RRM RADIO_FSM_USR: TXMODE (Bit 0) */
#define RRM_RADIO_FSM_USR_TXMODE_Msk                                       (0x1UL)    /*!< RRM RADIO_FSM_USR: TXMODE (Bitfield-Mask: 0x01) */
#define RRM_RADIO_FSM_USR_TXMODE                                           RRM_RADIO_FSM_USR_TXMODE_Msk

/* =====================================================    PHYCTRL_DIG_USR    ===================================================== */
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_Pos                                    (0UL)    /*!<RRM PHYCTRL_DIG_USR: RXTXPHY (Bit 0) */
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_Msk                                    (0x7UL)    /*!< RRM PHYCTRL_DIG_USR: RXTXPHY (Bitfield-Mask: 0x07) */
#define RRM_PHYCTRL_DIG_USR_RXTXPHY                                        RRM_PHYCTRL_DIG_USR_RXTXPHY_Msk
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_0                                      (0x1U << RRM_PHYCTRL_DIG_USR_RXTXPHY_Pos)
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_1                                      (0x2U << RRM_PHYCTRL_DIG_USR_RXTXPHY_Pos)
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_2                                      (0x4U << RRM_PHYCTRL_DIG_USR_RXTXPHY_Pos)

/* =====================================================    AFC0_DIG_ENG    ===================================================== */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Pos                               (4UL)    /*!<RRM AFC0_DIG_ENG: AFC_GAIN_BEFORE (Bit 4) */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Msk                               (0xf0UL)   /*!< RRM AFC0_DIG_ENG: AFC_GAIN_BEFORE (Bitfield-Mask: 0x0f) */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE                                   RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Msk
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_0                                 (0x1U << RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Pos)
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_1                                 (0x2U << RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Pos)
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_2                                 (0x4U << RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Pos)
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_3                                 (0x8U << RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Pos)
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Pos                                (0UL)    /*!<RRM AFC0_DIG_ENG: AFC_GAIN_AFTER (Bit 0) */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Msk                                (0xfUL)    /*!< RRM AFC0_DIG_ENG: AFC_GAIN_AFTER (Bitfield-Mask: 0x0f) */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER                                    RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Msk
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_0                                  (0x1U << RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Pos)
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_1                                  (0x2U << RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Pos)
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_2                                  (0x4U << RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Pos)
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_3                                  (0x8U << RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Pos)

/* =====================================================    AFC1_DIG_ENG    ===================================================== */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos                              (4UL)    /*!<RRM AFC1_DIG_ENG: AFC_DELAY_BEFORE (Bit 4) */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Msk                              (0xf0UL)   /*!< RRM AFC1_DIG_ENG: AFC_DELAY_BEFORE (Bitfield-Mask: 0x0f) */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE                                  RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Msk
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_0                                (0x1U << RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_1                                (0x2U << RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_2                                (0x4U << RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_3                                (0x8U << RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos                               (0UL)    /*!<RRM AFC1_DIG_ENG: AFC_DELAY_AFTER (Bit 0) */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Msk                               (0xfUL)    /*!< RRM AFC1_DIG_ENG: AFC_DELAY_AFTER (Bitfield-Mask: 0x0f) */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER                                   RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Msk
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_0                                 (0x1U << RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_1                                 (0x2U << RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_2                                 (0x4U << RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_3                                 (0x8U << RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos)

