embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    VIT_CONF_DIG_ENG    ===================================================== */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos                                  (0UL)    /*!<RRM VIT_CONF_DIG_ENG: VIT_CONF (Bit 0) */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_Msk                                  (0xffUL)   /*!< RRM VIT_CONF_DIG_ENG: VIT_CONF (Bitfield-Mask: 0xff) */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF                                      RRM_VIT_CONF_DIG_ENG_VIT_CONF_Msk
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_0                                    (0x1U << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_1                                    (0x2U << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_2                                    (0x4U << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_3                                    (0x8U << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_4                                    (0x10U << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_5                                    (0x20U << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_6                                    (0x40U << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_7                                    (0x80U << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)

/* =====================================================    LR_PD_THR_DIG_ENG    ===================================================== */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos                                (0UL)    /*!<RRM LR_PD_THR_DIG_ENG: LR_PD_THR (Bit 0) */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Msk                                (0xffUL)   /*!< RRM LR_PD_THR_DIG_ENG: LR_PD_THR (Bitfield-Mask: 0xff) */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR                                    RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Msk
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_0                                  (0x1U << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_1                                  (0x2U << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_2                                  (0x4U << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_3                                  (0x8U << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_4                                  (0x10U << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_5                                  (0x20U << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_6                                  (0x40U << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_7                                  (0x80U << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)

/* =====================================================    LR_RSSI_THR_DIG_ENG    ===================================================== */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos                            (0UL)    /*!<RRM LR_RSSI_THR_DIG_ENG: LR_RSSI_THR (Bit 0) */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Msk                            (0xffUL)   /*!< RRM LR_RSSI_THR_DIG_ENG: LR_RSSI_THR (Bitfield-Mask: 0xff) */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR                                RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Msk
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_0                              (0x1U << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_1                              (0x2U << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_2                              (0x4U << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_3                              (0x8U << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_4                              (0x10U << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_5                              (0x20U << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_6                              (0x40U << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_7                              (0x80U << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)

/* =====================================================    LR_AAC_THR_DIG_ENG    ===================================================== */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos                              (0UL)    /*!<RRM LR_AAC_THR_DIG_ENG: LR_AAC_THR (Bit 0) */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Msk                              (0xffUL)   /*!< RRM LR_AAC_THR_DIG_ENG: LR_AAC_THR (Bitfield-Mask: 0xff) */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR                                  RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Msk
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_0                                (0x1U << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_1                                (0x2U << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_2                                (0x4U << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_3                                (0x8U << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_4                                (0x10U << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_5                                (0x20U << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_6                                (0x40U << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_7                                (0x80U << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)

/* =====================================================    DTB0_DIG_ENG    ===================================================== */
#define RRM_DTB0_DIG_ENG_DTB_CFG_Pos                                       (1UL)    /*!<RRM DTB0_DIG_ENG: DTB_CFG (Bit 1) */
#define RRM_DTB0_DIG_ENG_DTB_CFG_Msk                                       (0x1eUL)   /*!< RRM DTB0_DIG_ENG: DTB_CFG (Bitfield-Mask: 0x0f) */
#define RRM_DTB0_DIG_ENG_DTB_CFG                                           RRM_DTB0_DIG_ENG_DTB_CFG_Msk
#define RRM_DTB0_DIG_ENG_DTB_CFG_0                                         (0x1U << RRM_DTB0_DIG_ENG_DTB_CFG_Pos)
#define RRM_DTB0_DIG_ENG_DTB_CFG_1                                         (0x2U << RRM_DTB0_DIG_ENG_DTB_CFG_Pos)
#define RRM_DTB0_DIG_ENG_DTB_CFG_2                                         (0x4U << RRM_DTB0_DIG_ENG_DTB_CFG_Pos)
#define RRM_DTB0_DIG_ENG_DTB_CFG_3                                         (0x8U << RRM_DTB0_DIG_ENG_DTB_CFG_Pos)
#define RRM_DTB0_DIG_ENG_DTB_EN_Pos                                        (0UL)    /*!<RRM DTB0_DIG_ENG: DTB_EN (Bit 0) */
#define RRM_DTB0_DIG_ENG_DTB_EN_Msk                                        (0x1UL)    /*!< RRM DTB0_DIG_ENG: DTB_EN (Bitfield-Mask: 0x01) */
#define RRM_DTB0_DIG_ENG_DTB_EN                                            RRM_DTB0_DIG_ENG_DTB_EN_Msk

