embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    DTB5_DIG_ENG    ===================================================== */
#define RRM_DTB5_DIG_ENG_PORT_SELECTED_0_Pos                               (5UL)    /*!<RRM DTB5_DIG_ENG: PORT_SELECTED_0 (Bit 5) */
#define RRM_DTB5_DIG_ENG_PORT_SELECTED_0_Msk                               (0x20UL)   /*!< RRM DTB5_DIG_ENG: PORT_SELECTED_0 (Bitfield-Mask: 0x01) */
#define RRM_DTB5_DIG_ENG_PORT_SELECTED_0                                   RRM_DTB5_DIG_ENG_PORT_SELECTED_0_Msk
#define RRM_DTB5_DIG_ENG_PORT_SELECTED_EN_Pos                              (4UL)    /*!<RRM DTB5_DIG_ENG: PORT_SELECTED_EN (Bit 4) */
#define RRM_DTB5_DIG_ENG_PORT_SELECTED_EN_Msk                              (0x10UL)   /*!< RRM DTB5_DIG_ENG: PORT_SELECTED_EN (Bitfield-Mask: 0x01) */
#define RRM_DTB5_DIG_ENG_PORT_SELECTED_EN                                  RRM_DTB5_DIG_ENG_PORT_SELECTED_EN_Msk
#define RRM_DTB5_DIG_ENG_INITIALIZE_Pos                                    (3UL)    /*!<RRM DTB5_DIG_ENG: INITIALIZE (Bit 3) */
#define RRM_DTB5_DIG_ENG_INITIALIZE_Msk                                    (0x8UL)    /*!< RRM DTB5_DIG_ENG: INITIALIZE (Bitfield-Mask: 0x01) */
#define RRM_DTB5_DIG_ENG_INITIALIZE                                        RRM_DTB5_DIG_ENG_INITIALIZE_Msk
#define RRM_DTB5_DIG_ENG_RX_ACTIVE_Pos                                     (2UL)    /*!<RRM DTB5_DIG_ENG: RX_ACTIVE (Bit 2) */
#define RRM_DTB5_DIG_ENG_RX_ACTIVE_Msk                                     (0x4UL)    /*!< RRM DTB5_DIG_ENG: RX_ACTIVE (Bitfield-Mask: 0x01) */
#define RRM_DTB5_DIG_ENG_RX_ACTIVE                                         RRM_DTB5_DIG_ENG_RX_ACTIVE_Msk
#define RRM_DTB5_DIG_ENG_TX_ACTIVE_Pos                                     (1UL)    /*!<RRM DTB5_DIG_ENG: TX_ACTIVE (Bit 1) */
#define RRM_DTB5_DIG_ENG_TX_ACTIVE_Msk                                     (0x2UL)    /*!< RRM DTB5_DIG_ENG: TX_ACTIVE (Bitfield-Mask: 0x01) */
#define RRM_DTB5_DIG_ENG_TX_ACTIVE                                         RRM_DTB5_DIG_ENG_TX_ACTIVE_Msk
#define RRM_DTB5_DIG_ENG_RXTX_START_SEL_Pos                                (0UL)    /*!<RRM DTB5_DIG_ENG: RXTX_START_SEL (Bit 0) */
#define RRM_DTB5_DIG_ENG_RXTX_START_SEL_Msk                                (0x1UL)    /*!< RRM DTB5_DIG_ENG: RXTX_START_SEL (Bitfield-Mask: 0x01) */
#define RRM_DTB5_DIG_ENG_RXTX_START_SEL                                    RRM_DTB5_DIG_ENG_RXTX_START_SEL_Msk

/* =====================================================    MOD0_DIG_TST    ===================================================== */
#define RRM_MOD0_DIG_TST_KFORCE_3_0_Pos                                    (4UL)    /*!<RRM MOD0_DIG_TST: KFORCE_3_0 (Bit 4) */
#define RRM_MOD0_DIG_TST_KFORCE_3_0_Msk                                    (0xf0UL)   /*!< RRM MOD0_DIG_TST: KFORCE_3_0 (Bitfield-Mask: 0x0f) */
#define RRM_MOD0_DIG_TST_KFORCE_3_0                                        RRM_MOD0_DIG_TST_KFORCE_3_0_Msk
#define RRM_MOD0_DIG_TST_KFORCE_3_0_0                                      (0x1U << RRM_MOD0_DIG_TST_KFORCE_3_0_Pos)
#define RRM_MOD0_DIG_TST_KFORCE_3_0_1                                      (0x2U << RRM_MOD0_DIG_TST_KFORCE_3_0_Pos)
#define RRM_MOD0_DIG_TST_KFORCE_3_0_2                                      (0x4U << RRM_MOD0_DIG_TST_KFORCE_3_0_Pos)
#define RRM_MOD0_DIG_TST_KFORCE_3_0_3                                      (0x8U << RRM_MOD0_DIG_TST_KFORCE_3_0_Pos)
#define RRM_MOD0_DIG_TST_PMU_NO_MODULTATION_Pos                            (3UL)    /*!<RRM MOD0_DIG_TST: PMU_NO_MODULTATION (Bit 3) */
#define RRM_MOD0_DIG_TST_PMU_NO_MODULTATION_Msk                            (0x8UL)    /*!< RRM MOD0_DIG_TST: PMU_NO_MODULTATION (Bitfield-Mask: 0x01) */
#define RRM_MOD0_DIG_TST_PMU_NO_MODULTATION                                RRM_MOD0_DIG_TST_PMU_NO_MODULTATION_Msk
#define RRM_MOD0_DIG_TST_MOD_DIG_TEST_SEL_Pos                              (0UL)    /*!<RRM MOD0_DIG_TST: MOD_DIG_TEST_SEL (Bit 0) */
#define RRM_MOD0_DIG_TST_MOD_DIG_TEST_SEL_Msk                              (0x1UL)    /*!< RRM MOD0_DIG_TST: MOD_DIG_TEST_SEL (Bitfield-Mask: 0x01) */
#define RRM_MOD0_DIG_TST_MOD_DIG_TEST_SEL                                  RRM_MOD0_DIG_TST_MOD_DIG_TEST_SEL_Msk

/* =====================================================    MOD1_DIG_TST    ===================================================== */
#define RRM_MOD1_DIG_TST_KFORCE_11_4_Pos                                   (0UL)    /*!<RRM MOD1_DIG_TST: KFORCE_11_4 (Bit 0) */
#define RRM_MOD1_DIG_TST_KFORCE_11_4_Msk                                   (0xffUL)   /*!< RRM MOD1_DIG_TST: KFORCE_11_4 (Bitfield-Mask: 0xff) */
#define RRM_MOD1_DIG_TST_KFORCE_11_4                                       RRM_MOD1_DIG_TST_KFORCE_11_4_Msk
#define RRM_MOD1_DIG_TST_KFORCE_11_4_0                                     (0x1U << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)
#define RRM_MOD1_DIG_TST_KFORCE_11_4_1                                     (0x2U << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)
#define RRM_MOD1_DIG_TST_KFORCE_11_4_2                                     (0x4U << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)
#define RRM_MOD1_DIG_TST_KFORCE_11_4_3                                     (0x8U << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)
#define RRM_MOD1_DIG_TST_KFORCE_11_4_4                                     (0x10U << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)
#define RRM_MOD1_DIG_TST_KFORCE_11_4_5                                     (0x20U << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)
#define RRM_MOD1_DIG_TST_KFORCE_11_4_6                                     (0x40U << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)
#define RRM_MOD1_DIG_TST_KFORCE_11_4_7                                     (0x80U << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)

/* =====================================================    MOD2_DIG_TST    ===================================================== */
#define RRM_MOD2_DIG_TST_KFORCE_19_12_Pos                                  (0UL)    /*!<RRM MOD2_DIG_TST: KFORCE_19_12 (Bit 0) */
#define RRM_MOD2_DIG_TST_KFORCE_19_12_Msk                                  (0xffUL)   /*!< RRM MOD2_DIG_TST: KFORCE_19_12 (Bitfield-Mask: 0xff) */
#define RRM_MOD2_DIG_TST_KFORCE_19_12                                      RRM_MOD2_DIG_TST_KFORCE_19_12_Msk
#define RRM_MOD2_DIG_TST_KFORCE_19_12_0                                    (0x1U << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)
#define RRM_MOD2_DIG_TST_KFORCE_19_12_1                                    (0x2U << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)
#define RRM_MOD2_DIG_TST_KFORCE_19_12_2                                    (0x4U << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)
#define RRM_MOD2_DIG_TST_KFORCE_19_12_3                                    (0x8U << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)
#define RRM_MOD2_DIG_TST_KFORCE_19_12_4                                    (0x10U << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)
#define RRM_MOD2_DIG_TST_KFORCE_19_12_5                                    (0x20U << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)
#define RRM_MOD2_DIG_TST_KFORCE_19_12_6                                    (0x40U << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)
#define RRM_MOD2_DIG_TST_KFORCE_19_12_7                                    (0x80U << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)

