embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    MOD3_DIG_TST    ===================================================== */
#define RRM_MOD3_DIG_TST_MFORCE_Pos                                        (3UL)    /*!<RRM MOD3_DIG_TST: MFORCE (Bit 3) */
#define RRM_MOD3_DIG_TST_MFORCE_Msk                                        (0xf8UL)   /*!< RRM MOD3_DIG_TST: MFORCE (Bitfield-Mask: 0x1f) */
#define RRM_MOD3_DIG_TST_MFORCE                                            RRM_MOD3_DIG_TST_MFORCE_Msk
#define RRM_MOD3_DIG_TST_MFORCE_0                                          (0x1U << RRM_MOD3_DIG_TST_MFORCE_Pos)
#define RRM_MOD3_DIG_TST_MFORCE_1                                          (0x2U << RRM_MOD3_DIG_TST_MFORCE_Pos)
#define RRM_MOD3_DIG_TST_MFORCE_2                                          (0x4U << RRM_MOD3_DIG_TST_MFORCE_Pos)
#define RRM_MOD3_DIG_TST_MFORCE_3                                          (0x8U << RRM_MOD3_DIG_TST_MFORCE_Pos)
#define RRM_MOD3_DIG_TST_MFORCE_4                                          (0x10U << RRM_MOD3_DIG_TST_MFORCE_Pos)
#define RRM_MOD3_DIG_TST_AFORCE_Pos                                        (0UL)    /*!<RRM MOD3_DIG_TST: AFORCE (Bit 0) */
#define RRM_MOD3_DIG_TST_AFORCE_Msk                                        (0x7UL)    /*!< RRM MOD3_DIG_TST: AFORCE (Bitfield-Mask: 0x07) */
#define RRM_MOD3_DIG_TST_AFORCE                                            RRM_MOD3_DIG_TST_AFORCE_Msk
#define RRM_MOD3_DIG_TST_AFORCE_0                                          (0x1U << RRM_MOD3_DIG_TST_AFORCE_Pos)
#define RRM_MOD3_DIG_TST_AFORCE_1                                          (0x2U << RRM_MOD3_DIG_TST_AFORCE_Pos)
#define RRM_MOD3_DIG_TST_AFORCE_2                                          (0x4U << RRM_MOD3_DIG_TST_AFORCE_Pos)

/* =====================================================    RXADC_ANA_USR    ===================================================== */
#define RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_Q_TST_SEL_Pos                    (7UL)    /*!<RRM RXADC_ANA_USR: RXADC_DELAYTRIM_Q_TST_SEL (Bit 7) */
#define RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_Q_TST_SEL_Msk                    (0x80UL)   /*!< RRM RXADC_ANA_USR: RXADC_DELAYTRIM_Q_TST_SEL (Bitfield-Mask: 0x01) */
#define RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_Q_TST_SEL                        RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_Q_TST_SEL_Msk
#define RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_I_TST_SEL_Pos                    (6UL)    /*!<RRM RXADC_ANA_USR: RXADC_DELAYTRIM_I_TST_SEL (Bit 6) */
#define RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_I_TST_SEL_Msk                    (0x40UL)   /*!< RRM RXADC_ANA_USR: RXADC_DELAYTRIM_I_TST_SEL (Bitfield-Mask: 0x01) */
#define RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_I_TST_SEL                        RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_I_TST_SEL_Msk
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Pos                        (3UL)    /*!<RRM RXADC_ANA_USR: RFD_RXADC_DELAYTRIM_Q (Bit 3) */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Msk                        (0x38UL)   /*!< RRM RXADC_ANA_USR: RFD_RXADC_DELAYTRIM_Q (Bitfield-Mask: 0x07) */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q                            RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Msk
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_0                          (0x1U << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_1                          (0x2U << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_2                          (0x4U << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Pos                        (0UL)    /*!<RRM RXADC_ANA_USR: RFD_RXADC_DELAYTRIM_I (Bit 0) */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Msk                        (0x7UL)    /*!< RRM RXADC_ANA_USR: RFD_RXADC_DELAYTRIM_I (Bitfield-Mask: 0x07) */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I                            RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Msk
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_0                          (0x1U << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Pos)
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_1                          (0x2U << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Pos)
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_2                          (0x4U << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Pos)

/* =====================================================    LDO_ANA_ENG    ===================================================== */
#define RRM_LDO_ANA_ENG_RFD_LDO_TRANSFO_BYPASS_Pos                         (1UL)    /*!<RRM LDO_ANA_ENG: RFD_LDO_TRANSFO_BYPASS (Bit 1) */
#define RRM_LDO_ANA_ENG_RFD_LDO_TRANSFO_BYPASS_Msk                         (0x2UL)    /*!< RRM LDO_ANA_ENG: RFD_LDO_TRANSFO_BYPASS (Bitfield-Mask: 0x01) */
#define RRM_LDO_ANA_ENG_RFD_LDO_TRANSFO_BYPASS                             RRM_LDO_ANA_ENG_RFD_LDO_TRANSFO_BYPASS_Msk
#define RRM_LDO_ANA_ENG_RFD_RF_REG_BYPASS_Pos                              (0UL)    /*!<RRM LDO_ANA_ENG: RFD_RF_REG_BYPASS (Bit 0) */
#define RRM_LDO_ANA_ENG_RFD_RF_REG_BYPASS_Msk                              (0x1UL)    /*!< RRM LDO_ANA_ENG: RFD_RF_REG_BYPASS (Bitfield-Mask: 0x01) */
#define RRM_LDO_ANA_ENG_RFD_RF_REG_BYPASS                                  RRM_LDO_ANA_ENG_RFD_RF_REG_BYPASS_Msk

/* =====================================================    CBIAS0_ANA_ENG    ===================================================== */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos                        (4UL)    /*!<RRM CBIAS0_ANA_ENG: RFD_CBIAS_IPTAT_TRIM (Bit 4) */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Msk                        (0xf0UL)   /*!< RRM CBIAS0_ANA_ENG: RFD_CBIAS_IPTAT_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM                            RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Msk
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_0                          (0x1U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_1                          (0x2U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_2                          (0x4U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_3                          (0x8U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos                        (0UL)    /*!<RRM CBIAS0_ANA_ENG: RFD_CBIAS_IBIAS_TRIM (Bit 0) */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Msk                        (0xfUL)    /*!< RRM CBIAS0_ANA_ENG: RFD_CBIAS_IBIAS_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM                            RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Msk
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_0                          (0x1U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_1                          (0x2U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_2                          (0x4U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_3                          (0x8U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos)

/* =====================================================    CBIAS1_ANA_ENG    ===================================================== */
#define RRM_CBIAS1_ANA_ENG_CBIAS0_TRIM_TST_SEL_Pos                         (7UL)    /*!<RRM CBIAS1_ANA_ENG: CBIAS0_TRIM_TST_SEL (Bit 7) */
#define RRM_CBIAS1_ANA_ENG_CBIAS0_TRIM_TST_SEL_Msk                         (0x80UL)   /*!< RRM CBIAS1_ANA_ENG: CBIAS0_TRIM_TST_SEL (Bitfield-Mask: 0x01) */
#define RRM_CBIAS1_ANA_ENG_CBIAS0_TRIM_TST_SEL                             RRM_CBIAS1_ANA_ENG_CBIAS0_TRIM_TST_SEL_Msk
#define RRM_CBIAS1_ANA_ENG_CBIAS_VBG_TRIM_TST_SEL_Pos                      (6UL)    /*!<RRM CBIAS1_ANA_ENG: CBIAS_VBG_TRIM_TST_SEL (Bit 6) */
#define RRM_CBIAS1_ANA_ENG_CBIAS_VBG_TRIM_TST_SEL_Msk                      (0x40UL)   /*!< RRM CBIAS1_ANA_ENG: CBIAS_VBG_TRIM_TST_SEL (Bitfield-Mask: 0x01) */
#define RRM_CBIAS1_ANA_ENG_CBIAS_VBG_TRIM_TST_SEL                          RRM_CBIAS1_ANA_ENG_CBIAS_VBG_TRIM_TST_SEL_Msk
#define RRM_CBIAS1_ANA_ENG_CBIAS_CURR2_PREBOOST_Pos                        (5UL)    /*!<RRM CBIAS1_ANA_ENG: CBIAS_CURR2_PREBOOST (Bit 5) */
#define RRM_CBIAS1_ANA_ENG_CBIAS_CURR2_PREBOOST_Msk                        (0x20UL)   /*!< RRM CBIAS1_ANA_ENG: CBIAS_CURR2_PREBOOST (Bitfield-Mask: 0x01) */
#define RRM_CBIAS1_ANA_ENG_CBIAS_CURR2_PREBOOST                            RRM_CBIAS1_ANA_ENG_CBIAS_CURR2_PREBOOST_Msk
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_ENA_ATB_CURR_Pos                      (4UL)    /*!<RRM CBIAS1_ANA_ENG: RFD_CBIAS_ENA_ATB_CURR (Bit 4) */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_ENA_ATB_CURR_Msk                      (0x10UL)   /*!< RRM CBIAS1_ANA_ENG: RFD_CBIAS_ENA_ATB_CURR (Bitfield-Mask: 0x01) */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_ENA_ATB_CURR                          RRM_CBIAS1_ANA_ENG_RFD_CBIAS_ENA_ATB_CURR_Msk
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos                          (0UL)    /*!<RRM CBIAS1_ANA_ENG: RFD_CBIAS_VBG_TRIM (Bit 0) */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Msk                          (0xfUL)    /*!< RRM CBIAS1_ANA_ENG: RFD_CBIAS_VBG_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM                              RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Msk
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_0                            (0x1U << RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos)
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_1                            (0x2U << RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos)
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_2                            (0x4U << RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos)
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_3                            (0x8U << RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos)

/* =====================================================    SYNTHCAL0_DIG_OUT    ===================================================== */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos                       (0UL)    /*!<RRM SYNTHCAL0_DIG_OUT: VCO_CALAMP_OUT_6_0 (Bit 0) */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Msk                       (0x7fUL)   /*!< RRM SYNTHCAL0_DIG_OUT: VCO_CALAMP_OUT_6_0 (Bitfield-Mask: 0x7f) */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0                           RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Msk
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_0                         (0x1U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_1                         (0x2U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_2                         (0x4U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_3                         (0x8U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_4                         (0x10U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_5                         (0x20U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_6                         (0x40U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)

/* =====================================================    SYNTHCAL1_DIG_OUT    ===================================================== */
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos                      (0UL)    /*!<RRM SYNTHCAL1_DIG_OUT: VCO_CALAMP_OUT_10_7 (Bit 0) */
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Msk                      (0xfUL)    /*!< RRM SYNTHCAL1_DIG_OUT: VCO_CALAMP_OUT_10_7 (Bitfield-Mask: 0x0f) */
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7                          RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Msk
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_0                        (0x1U << RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos)
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_1                        (0x2U << RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos)
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_2                        (0x4U << RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos)
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_3                        (0x8U << RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos)

/* =====================================================    SYNTHCAL2_DIG_OUT    ===================================================== */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos                          (0UL)    /*!<RRM SYNTHCAL2_DIG_OUT: VCO_CALFREQ_OUT (Bit 0) */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Msk                          (0x7fUL)   /*!< RRM SYNTHCAL2_DIG_OUT: VCO_CALFREQ_OUT (Bitfield-Mask: 0x7f) */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT                              RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Msk
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_0                            (0x1U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_1                            (0x2U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_2                            (0x4U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_3                            (0x8U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_4                            (0x10U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_5                            (0x20U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_6                            (0x40U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)

/* =====================================================    SYNTHCAL3_DIG_OUT    ===================================================== */
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos                       (0UL)    /*!<RRM SYNTHCAL3_DIG_OUT: SYNTHCAL_DEBUG_BUS (Bit 0) */
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Msk                       (0xffUL)   /*!< RRM SYNTHCAL3_DIG_OUT: SYNTHCAL_DEBUG_BUS (Bitfield-Mask: 0xff) */
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS                           RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Msk
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_0                         (0x1U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_1                         (0x2U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_2                         (0x4U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_3                         (0x8U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_4                         (0x10U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_5                         (0x20U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_6                         (0x40U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_7                         (0x80U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)

