embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    SYNTHCAL4_DIG_OUT    ===================================================== */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos                     (0UL)    /*!<RRM SYNTHCAL4_DIG_OUT: MOD_REF_DAC_WORD_OUT (Bit 0) */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Msk                     (0x3fUL)   /*!< RRM SYNTHCAL4_DIG_OUT: MOD_REF_DAC_WORD_OUT (Bitfield-Mask: 0x3f) */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT                         RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Msk
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_0                       (0x1U << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_1                       (0x2U << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_2                       (0x4U << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_3                       (0x8U << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_4                       (0x10U << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_5                       (0x20U << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)

/* =====================================================    SYNTHCAL5_DIG_OUT    ===================================================== */
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos                           (0UL)    /*!<RRM SYNTHCAL5_DIG_OUT: CBP_CALIB_WORD (Bit 0) */
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Msk                           (0xfUL)    /*!< RRM SYNTHCAL5_DIG_OUT: CBP_CALIB_WORD (Bitfield-Mask: 0x0f) */
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD                               RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Msk
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_0                             (0x1U << RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos)
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_1                             (0x2U << RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos)
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_2                             (0x4U << RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos)
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_3                             (0x8U << RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos)

/* =====================================================    FSM_STATUS_DIG_OUT    ===================================================== */
#define RRM_FSM_STATUS_DIG_OUT_SYNTH_CAL_ERROR_Pos                         (7UL)    /*!<RRM FSM_STATUS_DIG_OUT: SYNTH_CAL_ERROR (Bit 7) */
#define RRM_FSM_STATUS_DIG_OUT_SYNTH_CAL_ERROR_Msk                         (0x80UL)   /*!< RRM FSM_STATUS_DIG_OUT: SYNTH_CAL_ERROR (Bitfield-Mask: 0x01) */
#define RRM_FSM_STATUS_DIG_OUT_SYNTH_CAL_ERROR                             RRM_FSM_STATUS_DIG_OUT_SYNTH_CAL_ERROR_Msk
#define RRM_FSM_STATUS_DIG_OUT_STATUS_Pos                                  (0UL)    /*!<RRM FSM_STATUS_DIG_OUT: STATUS (Bit 0) */
#define RRM_FSM_STATUS_DIG_OUT_STATUS_Msk                                  (0x1fUL)   /*!< RRM FSM_STATUS_DIG_OUT: STATUS (Bitfield-Mask: 0x1f) */
#define RRM_FSM_STATUS_DIG_OUT_STATUS                                      RRM_FSM_STATUS_DIG_OUT_STATUS_Msk
#define RRM_FSM_STATUS_DIG_OUT_STATUS_0                                    (0x1U << RRM_FSM_STATUS_DIG_OUT_STATUS_Pos)
#define RRM_FSM_STATUS_DIG_OUT_STATUS_1                                    (0x2U << RRM_FSM_STATUS_DIG_OUT_STATUS_Pos)
#define RRM_FSM_STATUS_DIG_OUT_STATUS_2                                    (0x4U << RRM_FSM_STATUS_DIG_OUT_STATUS_Pos)
#define RRM_FSM_STATUS_DIG_OUT_STATUS_3                                    (0x8U << RRM_FSM_STATUS_DIG_OUT_STATUS_Pos)
#define RRM_FSM_STATUS_DIG_OUT_STATUS_4                                    (0x10U << RRM_FSM_STATUS_DIG_OUT_STATUS_Pos)

/* =====================================================    IRQ_STATUS_DIG_OUT    ===================================================== */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_Pos                             (0UL)    /*!<RRM IRQ_STATUS_DIG_OUT: RESERVED7_0 (Bit 0) */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_Msk                             (0xffUL)   /*!< RRM IRQ_STATUS_DIG_OUT: RESERVED7_0 (Bitfield-Mask: 0xff) */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0                                 RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_Msk
#define RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_0                               (0x1U << RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_Pos)
#define RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_1                               (0x2U << RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_Pos)
#define RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_2                               (0x4U << RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_Pos)
#define RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_3                               (0x8U << RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_Pos)
#define RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_4                               (0x10U << RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_Pos)
#define RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_5                               (0x20U << RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_Pos)
#define RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_6                               (0x40U << RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_Pos)
#define RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_7                               (0x80U << RRM_IRQ_STATUS_DIG_OUT_RESERVED7_0_Pos)

/* =====================================================    RSSI0_DIG_OUT    ===================================================== */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos                            (0UL)    /*!<RRM RSSI0_DIG_OUT: RSSI_MEAS_OUT_7_0 (Bit 0) */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Msk                            (0xffUL)   /*!< RRM RSSI0_DIG_OUT: RSSI_MEAS_OUT_7_0 (Bitfield-Mask: 0xff) */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0                                RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Msk
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_0                              (0x1U << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_1                              (0x2U << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_2                              (0x4U << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_3                              (0x8U << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_4                              (0x10U << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_5                              (0x20U << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_6                              (0x40U << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_7                              (0x80U << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)

/* =====================================================    RSSI1_DIG_OUT    ===================================================== */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos                           (0UL)    /*!<RRM RSSI1_DIG_OUT: RSSI_MEAS_OUT_15_8 (Bit 0) */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Msk                           (0xffUL)   /*!< RRM RSSI1_DIG_OUT: RSSI_MEAS_OUT_15_8 (Bitfield-Mask: 0xff) */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8                               RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Msk
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_0                             (0x1U << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_1                             (0x2U << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_2                             (0x4U << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_3                             (0x8U << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_4                             (0x10U << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_5                             (0x20U << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_6                             (0x40U << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_7                             (0x80U << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)

/* =====================================================    AGC_DIG_OUT    ===================================================== */
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT_Pos                                    (0UL)    /*!<RRM AGC_DIG_OUT: AGC_ATT_OUT (Bit 0) */
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT_Msk                                    (0xfUL)    /*!< RRM AGC_DIG_OUT: AGC_ATT_OUT (Bitfield-Mask: 0x0f) */
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT                                        RRM_AGC_DIG_OUT_AGC_ATT_OUT_Msk
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT_0                                      (0x1U << RRM_AGC_DIG_OUT_AGC_ATT_OUT_Pos)
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT_1                                      (0x2U << RRM_AGC_DIG_OUT_AGC_ATT_OUT_Pos)
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT_2                                      (0x4U << RRM_AGC_DIG_OUT_AGC_ATT_OUT_Pos)
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT_3                                      (0x8U << RRM_AGC_DIG_OUT_AGC_ATT_OUT_Pos)

/* =====================================================    DEMOD_DIG_OUT    ===================================================== */
#define RRM_DEMOD_DIG_OUT_RX_END_Pos                                       (4UL)    /*!<RRM DEMOD_DIG_OUT: RX_END (Bit 4) */
#define RRM_DEMOD_DIG_OUT_RX_END_Msk                                       (0x10UL)   /*!< RRM DEMOD_DIG_OUT: RX_END (Bitfield-Mask: 0x01) */
#define RRM_DEMOD_DIG_OUT_RX_END                                           RRM_DEMOD_DIG_OUT_RX_END_Msk
#define RRM_DEMOD_DIG_OUT_PD_FOUND_Pos                                     (3UL)    /*!<RRM DEMOD_DIG_OUT: PD_FOUND (Bit 3) */
#define RRM_DEMOD_DIG_OUT_PD_FOUND_Msk                                     (0x8UL)    /*!< RRM DEMOD_DIG_OUT: PD_FOUND (Bitfield-Mask: 0x01) */
#define RRM_DEMOD_DIG_OUT_PD_FOUND                                         RRM_DEMOD_DIG_OUT_PD_FOUND_Msk
#define RRM_DEMOD_DIG_OUT_AAC_FOUND_Pos                                    (2UL)    /*!<RRM DEMOD_DIG_OUT: AAC_FOUND (Bit 2) */
#define RRM_DEMOD_DIG_OUT_AAC_FOUND_Msk                                    (0x4UL)    /*!< RRM DEMOD_DIG_OUT: AAC_FOUND (Bitfield-Mask: 0x01) */
#define RRM_DEMOD_DIG_OUT_AAC_FOUND                                        RRM_DEMOD_DIG_OUT_AAC_FOUND_Msk
#define RRM_DEMOD_DIG_OUT_CI_FIELD_Pos                                     (0UL)    /*!<RRM DEMOD_DIG_OUT: CI_FIELD (Bit 0) */
#define RRM_DEMOD_DIG_OUT_CI_FIELD_Msk                                     (0x3UL)    /*!< RRM DEMOD_DIG_OUT: CI_FIELD (Bitfield-Mask: 0x03) */
#define RRM_DEMOD_DIG_OUT_CI_FIELD                                         RRM_DEMOD_DIG_OUT_CI_FIELD_Msk
#define RRM_DEMOD_DIG_OUT_CI_FIELD_0                                       (0x1U << RRM_DEMOD_DIG_OUT_CI_FIELD_Pos)
#define RRM_DEMOD_DIG_OUT_CI_FIELD_1                                       (0x2U << RRM_DEMOD_DIG_OUT_CI_FIELD_Pos)

/* =====================================================    AGC0_DIG_ENG    ===================================================== */
#define RRM_AGC0_DIG_ENG_AGC_ENABLE_Pos                                    (6UL)    /*!<RRM AGC0_DIG_ENG: AGC_ENABLE (Bit 6) */
#define RRM_AGC0_DIG_ENG_AGC_ENABLE_Msk                                    (0x40UL)   /*!< RRM AGC0_DIG_ENG: AGC_ENABLE (Bitfield-Mask: 0x01) */
#define RRM_AGC0_DIG_ENG_AGC_ENABLE                                        RRM_AGC0_DIG_ENG_AGC_ENABLE_Msk
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos                                  (0UL)    /*!<RRM AGC0_DIG_ENG: AGC_THR_HIGH (Bit 0) */
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Msk                                  (0x3fUL)   /*!< RRM AGC0_DIG_ENG: AGC_THR_HIGH (Bitfield-Mask: 0x3f) */
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH                                      RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Msk
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_0                                    (0x1U << RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos)
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_1                                    (0x2U << RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos)
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_2                                    (0x4U << RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos)
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_3                                    (0x8U << RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos)
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_4                                    (0x10U << RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos)
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_5                                    (0x20U << RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos)

/* =====================================================    AGC1_DIG_ENG    ===================================================== */
#define RRM_AGC1_DIG_ENG_AGC_LOCK_SYNC_Pos                                 (7UL)    /*!<RRM AGC1_DIG_ENG: AGC_LOCK_SYNC (Bit 7) */
#define RRM_AGC1_DIG_ENG_AGC_LOCK_SYNC_Msk                                 (0x80UL)   /*!< RRM AGC1_DIG_ENG: AGC_LOCK_SYNC (Bitfield-Mask: 0x01) */
#define RRM_AGC1_DIG_ENG_AGC_LOCK_SYNC                                     RRM_AGC1_DIG_ENG_AGC_LOCK_SYNC_Msk
#define RRM_AGC1_DIG_ENG_AGC_AUTOLOCK_Pos                                  (6UL)    /*!<RRM AGC1_DIG_ENG: AGC_AUTOLOCK (Bit 6) */
#define RRM_AGC1_DIG_ENG_AGC_AUTOLOCK_Msk                                  (0x40UL)   /*!< RRM AGC1_DIG_ENG: AGC_AUTOLOCK (Bitfield-Mask: 0x01) */
#define RRM_AGC1_DIG_ENG_AGC_AUTOLOCK                                      RRM_AGC1_DIG_ENG_AGC_AUTOLOCK_Msk
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos                                 (0UL)    /*!<RRM AGC1_DIG_ENG: AGC_THR_LOW_6 (Bit 0) */
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Msk                                 (0x3fUL)   /*!< RRM AGC1_DIG_ENG: AGC_THR_LOW_6 (Bitfield-Mask: 0x3f) */
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6                                     RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Msk
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_0                                   (0x1U << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_1                                   (0x2U << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_2                                   (0x4U << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_3                                   (0x8U << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_4                                   (0x10U << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_5                                   (0x20U << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)

