embassy-rs/stm32-data-sources/headers/stm32wb05xx.h
/* =====================================================    ANTSW0_DIG_USR    ===================================================== */
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos                           (0UL)    /*!<RRM ANTSW0_DIG_USR: RX_TIME_TO_SAMPLE (Bit 0) */
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Msk                           (0xffUL)   /*!< RRM ANTSW0_DIG_USR: RX_TIME_TO_SAMPLE (Bitfield-Mask: 0xff) */
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE                               RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Msk
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_0                             (0x1U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_1                             (0x2U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_2                             (0x4U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_3                             (0x8U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_4                             (0x10U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_5                             (0x20U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_6                             (0x40U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_7                             (0x80U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)

/* =====================================================    ANTSW1_DIG_USR    ===================================================== */
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos                           (0UL)    /*!<RRM ANTSW1_DIG_USR: RX_TIME_TO_SWITCH (Bit 0) */
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Msk                           (0xffUL)   /*!< RRM ANTSW1_DIG_USR: RX_TIME_TO_SWITCH (Bitfield-Mask: 0xff) */
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH                               RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Msk
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_0                             (0x1U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_1                             (0x2U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_2                             (0x4U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_3                             (0x8U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_4                             (0x10U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_5                             (0x20U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_6                             (0x40U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_7                             (0x80U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)

/* =====================================================    ANTSW2_DIG_USR    ===================================================== */
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos                           (0UL)    /*!<RRM ANTSW2_DIG_USR: TX_TIME_TO_SWITCH (Bit 0) */
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Msk                           (0xffUL)   /*!< RRM ANTSW2_DIG_USR: TX_TIME_TO_SWITCH (Bitfield-Mask: 0xff) */
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH                               RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Msk
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_0                             (0x1U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_1                             (0x2U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_2                             (0x4U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_3                             (0x8U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_4                             (0x10U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_5                             (0x20U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_6                             (0x40U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_7                             (0x80U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)

/* =====================================================    ANTSW3_DIG_USR    ===================================================== */
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos                        (0UL)    /*!<RRM ANTSW3_DIG_USR: TX_TIME_TO_SWITCH_2M (Bit 0) */
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Msk                        (0xffUL)   /*!< RRM ANTSW3_DIG_USR: TX_TIME_TO_SWITCH_2M (Bitfield-Mask: 0xff) */
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M                            RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Msk
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_0                          (0x1U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_1                          (0x2U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_2                          (0x4U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_3                          (0x8U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_4                          (0x10U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_5                          (0x20U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_6                          (0x40U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_7                          (0x80U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)

/** @} */ /* End of group PosMask_peripherals */

/** @addtogroup Exported_macros
  * @{
  */

/*********************** UART Instances : Asynchronous mode *******************/
#define IS_UART_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

